{"dataset_name": "triviaQA", "data": {"Miami Beach in Florida borders which ocean?": {"answer_gt": "Atlantic", "answer_pred": " Atlantic Ocean", "query": "Miami Beach in Florida borders which ocean?", "docs": [{"k": 0, "title": "Miami Beach, Florida ", "text": " Miami Beach, Florida Miami Beach is a coastal resort city in Miami-Dade County, Florida, United States. It was incorporated on March 26, 1915. The municipality is located on natural and man-made barrier islands between the Atlantic Ocean and Biscayne Bay, the latter of which separates the Beach from Miami. The neighborhood of South Beach, comprising the southernmost of Miami Beach, along with downtown Miami and the Port of Miami, collectively form the commercial center of South Florida. As of the 2010 census, Miami Beach had a total population of 87,779. It has been one of America's pre-eminent beach resorts since"}, {"k": 1, "title": "North Miami Beach, Florida ", "text": " North Miami Beach is located at . According to the United States Census Bureau, the city has a total area of . of it is land and of it (6.43%) is water. Although the North Miami Beach boundaries once stretched to the Atlantic Ocean, this city on the Intracoastal Waterway no longer has any beaches within its city limits, although they are a short distance away across the inlet. As of 2010, there were 16,402 households out of which 12.1% were vacant. As of 2000, 37.6% had children under the age of 18 living with them. 44.3% were married couples"}, {"k": 2, "title": "Miami Beach, Florida ", "text": " with the record low of 32.3 F in January 1989. Miami Beach's location on the Atlantic Ocean, near its confluence with the Gulf of Mexico, make it extraordinarily vulnerable to hurricanes and tropical storms. Though direct strikes from hurricanes are rare (Miami has experienced only two direct hits from major hurricanes in recorded weather history – the 1926 Miami hurricane and Hurricane Cleo in 1964), the area has seen indirect contact from hurricanes Betsy (1965), Inez (1966), Andrew (1992), Irene (1999), Michelle (2001), Katrina (2005), Wilma (2005), and Irma (2017). , those of Hispanic or Latino ancestry accounted for 53.0%"}, {"k": 3, "title": "Miami-Dade County, Florida ", "text": " Atlantic Ocean. Miami-Dade County is only about above sea level. It is rather new geologically and located at the eastern edge of the Florida Platform, a carbonate plateau created millions of years ago. Eastern Dade is composed of Oolite limestone while western Dade is composed mostly of Bryozoa. Miami-Dade is among the last areas of Florida to be created and populated with fauna and flora, mostly in the Pleistocene. The bay is divided from the Atlantic Ocean by the many barrier isles along the coast, one of which is where well-known Miami Beach is located, home to South Beach and"}]}, "What was the occupation of Lovely Rita according to the song by the Beatles": {"answer_gt": "Traffic Warden", "answer_pred": " Traffic warden", "query": "What was the occupation of Lovely Rita according to the song by the Beatles", "docs": [{"k": 0, "title": "Lovely Rita ", "text": " Lovely Rita \"Lovely Rita\" is a song by the Beatles performed on the album \"Sgt. Pepper's Lonely Hearts Club Band\", written and sung by Paul McCartney and credited to Lennon–McCartney. It is about a female traffic warden and the narrator's affection for her. The term \"meter-maid\", largely unknown in the UK prior to the song's release, is American slang for a female traffic warden. According to some sources, the song originates from when a female traffic warden named Meta Davies issued a parking ticket to McCartney outside Abbey Road Studios. Instead of becoming angry, he accepted it with good grace"}, {"k": 1, "title": "Lovely Rita ", "text": " Out There! Tour. Lovely Rita \"Lovely Rita\" is a song by the Beatles performed on the album \"Sgt. Pepper's Lonely Hearts Club Band\", written and sung by Paul McCartney and credited to Lennon–McCartney. It is about a female traffic warden and the narrator's affection for her. The term \"meter-maid\", largely unknown in the UK prior to the song's release, is American slang for a female traffic warden. According to some sources, the song originates from when a female traffic warden named Meta Davies issued a parking ticket to McCartney outside Abbey Road Studios. Instead of becoming angry, he accepted it"}, {"k": 2, "title": "Lovely Rita ", "text": " little like a military man\" were band members playing comb and paper. Pink Floyd watched the Beatles recording \"Lovely Rita\". Later, Pink Floyd used effects inspired by \"Lovely Rita\" for recording their instrumental composition \"Pow R. Toc H.\" from their debut album, \"The Piper at the Gates of Dawn\". According to some sources George Harrison played slide guitar on the recording. However, this has not been confirmed by either MacDonald nor Lewisohn. Paul McCartney performed the song live for the first time by any Beatle on 4 May 2013 at the Estádio Mineirão, Belo Horizonte, Brazil and throughout his 2013–2015"}, {"k": 3, "title": "Pow R. Toc H. ", "text": " and watched the Beatles record \"Lovely Rita\" from \"Sgt. Pepper's Lonely Hearts Club Band\". Voice effects and noises similar to those used in \"Lovely Rita\" could be heard in \"Pow R. Toc H.\", recorded next door during the same period. In the song, Syd Barrett displays an early example of beatboxing. Roger Waters also uses the \"scream\" he later used in \"Careful with That Axe, Eugene\". \"Pow R. Toc H.\" was renamed \"The Pink Jungle\" in the \"Journey\" part of \"The Man and The Journey\". Pink Floyd performed the song live from 1967 to 1969. Pow R. Toc H. \"Pow"}]}, "Who was Poopdeck Pappys most famous son?": {"answer_gt": "Popeye", "answer_pred": " Popeye", "query": "Who was Poopdeck Pappys most famous son?", "docs": [{"k": 0, "title": "Poopdeck Pappy ", "text": " \"squinky\" eye and his pipe, he recognizes his long-lost father—though, as in their meeting on Goon Island, Pappy initially refuses to accept that Popeye is his son. He also appears in Popeye and Son, in \"Poopdeck Pappy and the Family Tree.\" While he comes to help his grandson Junior with his school report, traces of the classic Pappy come shining through when describing their ancestors in greater unsavory detail (much to Junior's initial dismay). Poopdeck Pappy Poopdeck Pappy is a fictional character featured in the \"Popeye\" (\"Thimble Theatre\") comic strip and animated cartoon spinoffs. Created by E. C. Segar in"}, {"k": 1, "title": "Poopdeck Pappy ", "text": " Poopdeck Pappy Poopdeck Pappy is a fictional character featured in the \"Popeye\" (\"Thimble Theatre\") comic strip and animated cartoon spinoffs. Created by E. C. Segar in 1936, the character is Popeye's father, who is between the ages of 85 and 99. Pappy first appeared in \"Thimble Theatre\" not long after Popeye acquired Eugene the Jeep in 1936. Popeye decided to use the creature's supernatural knowledge to find his father. An expedition was set up to go to Poopdeck's home on Barnacle Island, which included Toar the caveman and Olive Oyl. The ungrateful father answered Popeye's greeting with, \"You look like"}, {"k": 2, "title": "Poopdeck Pappy ", "text": " bean pole.\" (This stemmed from Poopdeck slugging Olive when they first met). However, while he is grumpy and somewhat hostile, he is quite protective of Popeye, and does have a hidden soft side. After Segar's death, Poopdeck's mother (called Granny who looks like her son and grandson, but wearing a bonnet) was introduced into the strip. She refuses to treat her son as an \"eighty-five year-old adult\" (his age has been reduced from 99 to 85 in the comic strip) and often disciplines him after his raucous \"nights on the town.\" She tends to be more amiable to Popeye, although"}, {"k": 3, "title": "Poopdeck Pappy ", "text": " mislaid can of spinach to rescue his only child. In the mêlée that ensues, the filmstrip is broken and the animator must safety pin it back together to finish the cartoon. Popeye is the spitting image of Poopdeck Pappy, though Pappy has a white beard. He is far less principled than his son, stealing from Popeye's bank account and trying to sell water for $5,000 in Death Valley. (To which, Popeye, while pouring water to the parched traveler, tells Poopdeck, \"I yam disgustipated wit' ya!\") There is no love lost between him and Olive Oyl, whom he calls a \"lath-legged"}]}, "The Nazi regime was Germany's Third Reich; which was the first Reich?": {"answer_gt": "HOLY ROMAN EMPIRE", "answer_pred": " Holy Roman Empire", "query": "The Nazi regime was Germany's Third Reich; which was the first Reich?", "docs": [{"k": 0, "title": "Nazi Germany ", "text": " Nazi leadership on trial for war crimes at the Nuremberg trials. The official name of the state was \"Deutsches Reich\" from 1933 to 1943 and \"Großdeutsches Reich\" from 1943 to 1945, while common English terms are \"Nazi Germany\" and \"Third Reich\". The latter, adopted by Nazi propaganda as \"Drittes Reich\", was first used in a 1923 book by Arthur Moeller van den Bruck. The book counted the Holy Roman Empire (962–1806) as the first Reich and the German Empire (1871–1918) as the second. Germany was known as the Weimar Republic during the years 1919 to 1933. It was a republic"}, {"k": 1, "title": "German Reich ", "text": " the German state between 1871 and 1918. The history of the nation-state known as the German \"Reich\" is commonly divided into three periods: The Nazi regime later called itself the \"Third Reich,\" counting the Holy Roman Empire as the first and the 1871 German Empire as the second, and ignoring the Weimar Republic. The name \"Deutsches Reich\" was occasionally applied in contemporary maps to the Holy Roman Empire (911–1806), also called \"Holy Roman Empire of the German Nation\" from the 16th century onwards, though it constituted a supranational entity extending beyond the frontiers of the German language area (\"Sprachraum\"). The"}, {"k": 2, "title": "Nazi Germany ", "text": " Nazi Germany Nazi Germany is the common English name for Germany between 1933 and 1945, when Adolf Hitler and his Nazi Party (NSDAP) controlled the country through a dictatorship. Under Hitler's rule, Germany was transformed into a totalitarian state that controlled nearly all aspects of life via the \"Gleichschaltung\" legal process. The official name of the state was Deutsches Reich (\"German Reich\") until 1943 and Großdeutsches Reich (\"Greater German Reich\") from 1943 to 1945. Nazi Germany is also known as the Third Reich, from German \"Drittes Reich\", meaning \"Third Realm\" or \"Third Empire\", the first two being the Holy Roman"}, {"k": 3, "title": "Fourth Reich ", "text": " Fourth Reich The Fourth Reich () is a hypothetical future German Reich that is the successor to the Third Reich (1933–1945). The term \"Third Reich\" was coined by Arthur Moeller van den Bruck in his 1923 book \"Das Dritte Reich\". He defined the Holy Roman Empire (962–1806) as the \"First Reich\", and the German Empire (1871–1918) as the \"Second Reich\", while the \"Third Reich\" was an ideal state including all German peoples, including Austria. In the modern context the term refers to Nazi Germany. It was used by the Nazis to legitimize their regime as a successor state to the"}]}, "At which English racecourse did two horses collapse and die in the parade ring due to electrocution, in February 2011?": {"answer_gt": "Newbury", "answer_pred": " Newbury", "query": "At which English racecourse did two horses collapse and die in the parade ring due to electrocution, in February 2011?", "docs": [{"k": 0, "title": "Newbury Racecourse ", "text": " The novice hurdle race went ahead, starting about 20 min late, but the rest of the day's racing was abandoned. On 17 February, the preliminary results of the investigation into the incident were released. Professor Tim Morris, Director of Equine Science and Welfare for the British Horseracing Authority, reported that they had been informed that there had been leakage from an electrical cable running under the parade ring. Both the horses had been examined postmortem and sudden cardiac arrest, consistent with accidental electrocution, had been identified as the cause of death and no other cause of death was further investigated."}, {"k": 1, "title": "Newbury Racecourse ", "text": " supporting their album Where We Are. Each year the racecourse hosts two music nights, with acts in recent years including: Jess Glynne, Olly Murs, Craig David and Rudimental. The racecourse has a dedicated railway station, which sees heavy traffic and additional trains on race days. It also acts as a venue for conferences, meetings, weddings and Hen and Stag parties. On 12 February 2011, two horses, Marching Song and Fenix Two, collapsed and died in the Paddock while parading for the first race of the day. Two others also appeared to have been affected, Kid Cassidy and The Merry Giant."}, {"k": 2, "title": "Cheltenham Festival ", "text": " the number of runners in certain races and re-sited one of the more difficult fences. On the opening day of the 2012 festival, three horses had to be euthanised after suffering bone fractures or breaks, including two during the Cross-Country Chase, becoming the second and third equine fatalities in that race since 2000. There were two further equine fatalities during the festival, and some critics claimed races should not have gone ahead due to the firmness of the ground following exceptionally dry weather. The RSPCA suggested that guidelines be reviewed, while the British Horseracing Authority (BHA) stated that \"with over"}, {"k": 3, "title": "Sedgefield Racecourse ", "text": " constructed in 1998, with better facilities for jockeys, officials and medical staff. In 1999, the future of the course was questioned after a horrific incident in a novices' chase. Three horses were killed after three riderless horses ran into the remainder of the field after running up the chase track the wrong way. The racecourse had just narrowly avoided closure for the third time that century. The purchase of the course by Northern Racing was completed in 2001. Since then they have invested around £600,000 on the racecourse, notably on a refurbished Parade Ring/Winners Enclosure, upgraded bars and eating areas"}]}, "Which type of hat takes its name from an 1894 novel by George Du Maurier where the title character has the surname O'Ferrall ?": {"answer_gt": "TRILBY", "answer_pred": " Trilby", "query": "Which type of hat takes its name from an 1894 novel by George Du Maurier where the title character has the surname O'Ferrall ?", "docs": [{"k": 0, "title": "George du Maurier ", "text": " a film, and as an opera. His second novel \"Trilby\", was published in 1894. It fitted into the gothic horror genre which was undergoing a revival during the \"fin de siècle\", and the book was hugely popular. The story of the poor artist's model Trilby O'Ferrall, transformed into a diva under the spell of the evil musical genius Svengali, created a sensation. Soap, songs, dances, toothpaste, and even the city of Trilby in Florida, were all named for the heroine, and the variety of soft felt hat with an indented crown that was worn in the London stage dramatization of"}, {"k": 1, "title": "Anthony Eden hat ", "text": " by King Edward VII who often visited Bad Homburg in Germany. It was essentially a more rigid variant of the trilby which had been fashionable since George du Maurier's novel of that name was published in 1894. The writer and broadcaster Rene Cutforth recalled in the 1970s that one of things that strikes me most about the Thirties scene when I think about it now is the trilby hat, the universal headgear of the middle classes ... [s]ometime early in the century, it must have been a wild gesture of freedom and informality ... By the thirties it had certainly"}, {"k": 2, "title": "Trilby (novel) ", "text": " Trilby (novel) Trilby is a novel by George du Maurier and one of the most popular novels of its time. Published serially in \"Harper's Monthly\" from January to August 1894, it was published in book form on 8 September 1895 and sold 200,000 copies in the United States alone. \"Trilby\" is set in the 1850s in an idyllic bohemian Paris. Though it features the stories of two English artists and a Scottish artist, one of the most memorable characters is Svengali, a rogue, masterful musician and hypnotist. Trilby O'Ferrall, the novel's heroine, is a half-Irish girl working in Paris as"}, {"k": 3, "title": "Trilby ", "text": " Maurier's 1894 novel \"Trilby\". A hat of this style was worn in the first London production of the play, and promptly came to be called \"a \"Trilby\" hat\". Its shape somewhat resembles the Tyrolean hat. Traditionally it was made from rabbit hair felt, but now is usually made from other materials, such as tweed, straw, heavyweight cotton, wool and wool/nylon blends. The hat reached its zenith of common popularity in the 1960s; the lower head clearance in American automobiles made it impractical to wear a hat with a tall crown while driving. It faded from popularity in the 1970s when"}]}, "What was the Elephant Man's real name?": {"answer_gt": "Joseph Merrick", "answer_pred": " Joseph Merrick", "query": "What was the Elephant Man's real name?", "docs": [{"k": 0, "title": "Elephant Man (musician) ", "text": " Elephant Man (musician) Oneal Bryan, better known by his stage name Elephant Man, (born September 11, 1975), is a Jamaican dancehall musician and singer. Born in Kingston, Jamaica, he started out his musical career as a member of the Scare Dem Crew, later continuing as a solo artist. He was later characterised for several trademarks, such as his dyed yellow-orange hair, his unique low-key voice, and his stage performance, which included jumping and running, or even climbing on stage props and monitors. His acoustic trademark is a light lisp. Bryan had his first international recognition when he and Puma settled"}, {"k": 1, "title": "The Monster (novella) ", "text": " freak show attractions such as Zip the Pinhead, whose real name was William Henry Johnson, and Joseph Merrick, the Elephant Man. It is also possible that Crane found thematic inspiration in Henrik Ibsen's \"An Enemy of the People\"; although first published in 1882, the play—about a physician who finds himself ostracized by his community—first became popular in the United States in the mid-1890s. Modern critics have connected the novella's themes of racial division to a violent episode in Port Jervis' history. On June 2, 1892, an African-American man named Robert Lewis was lynched for allegedly assaulting a local white woman."}, {"k": 2, "title": "The Elephant Man (film) ", "text": " The Elephant Man (film) The Elephant Man is a 1980 American historical drama film about Joseph Merrick (whom the script calls John Merrick), a severely deformed man in late 19th century London. The film was directed by David Lynch and stars John Hurt, Anthony Hopkins, Anne Bancroft, John Gielgud, Wendy Hiller, Michael Elphick, Hannah Gordon, and Freddie Jones. It was produced by Jonathan Sanger and Mel Brooks, the latter of whom was intentionally left uncredited to avoid confusion from audiences who possibly would have expected a comedy. The screenplay was adapted by Lynch, Christopher De Vore, and Eric Bergren from"}, {"k": 3, "title": "Tom Norman ", "text": " Tom Norman Tom Norman, born Thomas Noakes, (7 May 1860 – 24 August 1930), was an English businessman, showman and the last exhibitor of Joseph Merrick who was otherwise known as the \"Elephant Man\". Among his later exhibits were a troupe of midgets, a \"Man in a Trance\", \"John Chambers the armless Carpenter\", and the \"World's Ugliest Woman\". Norman started his working life as a butcher in Sussex before moving to London at the age of 14 where he sought a career on the music hall stage. There, he became interested in freak shows which he attended in his spare"}]}, "Which number Beethoven symphony is known as ‘The Pastoral’?": {"answer_gt": "SIXTH", "answer_pred": " Symphony No. 6", "query": "Which number Beethoven symphony is known as ‘The Pastoral’?", "docs": [{"k": 0, "title": "Symphony No. 6 (Beethoven) ", "text": " Symphony No. 6 (Beethoven) The Symphony No. 6 in F major, Op. 68, also known as the Pastoral Symphony (German: \"Pastorale\"), is a symphony composed by Ludwig van Beethoven and completed in 1808. One of Beethoven's few works containing explicitly programmatic content, the symphony was first performed in the Theater an der Wien on 22 December 1808 in a four-hour concert. Beethoven was a lover of nature who spent a great deal of his time on walks in the country. He frequently left Vienna to work in rural locations. The composer said that the Sixth Symphony is \"more the expression"}, {"k": 1, "title": "Symphony No. 6 (Beethoven) ", "text": " ending sequence. Symphony No. 6 (Beethoven) The Symphony No. 6 in F major, Op. 68, also known as the Pastoral Symphony (German: \"Pastorale\"), is a symphony composed by Ludwig van Beethoven and completed in 1808. One of Beethoven's few works containing explicitly programmatic content, the symphony was first performed in the Theater an der Wien on 22 December 1808 in a four-hour concert. Beethoven was a lover of nature who spent a great deal of his time on walks in the country. He frequently left Vienna to work in rural locations. The composer said that the Sixth Symphony is \"more"}, {"k": 2, "title": "Piano Sonata No. 15 (Beethoven) ", "text": " and harmonic texture. The coda, played a little faster than the allegro (\"Più allegro\"), can be termed as the only 'virtuoso' passage in the whole sonata. It has been debated whether the title ‘pastoral’ refers to the sense of countryside and nature (the 6th symphony pastoral sense), or to its sense of calm, simplicity and lightness. Beethoven's publishers had a tendency to name his sonatas without consulting Beethoven himself. Piano Sonata No. 15 (Beethoven) Piano Sonata No. 15 in D major, Op. 28, is a piano sonata by Ludwig van Beethoven. The name Pastoral or Pastorale became known through A."}, {"k": 3, "title": "Piano Sonata No. 15 (Beethoven) ", "text": " Piano Sonata No. 15 (Beethoven) Piano Sonata No. 15 in D major, Op. 28, is a piano sonata by Ludwig van Beethoven. The name Pastoral or Pastorale became known through A. Cranz publishing of Beethoven's work, but was first coined by a London publisher, Broderip & Wilkinson. While not as famous as its immediate predecessor, Piano Sonata No. 14, it is generally admired for its intricate technicality as well as for its beauty. The sonata takes roughly twenty-five minutes to play with its intended repeats. Published in 1801, the work is dedicated to the Count Joseph von Sonnenfels. The sonata"}]}, "Which man won a record 26 Academy Award 'Oscars'?": {"answer_gt": "Walt Disney", "answer_pred": " John Ford", "query": "Which man won a record 26 Academy Award 'Oscars'?", "docs": [{"k": 0, "title": "26th Academy Awards ", "text": " base just prior to the Pearl Harbor attack and World War II, illustrating the conflict between an individualistic private (Montgomery Clift) and rigid institutional authority (exemplified by the Army). Its achievement of eight awards matched the then record held by \"Gone with the Wind\" (1939). The record would be tied again the following year by \"On the Waterfront\" (1954). Walt Disney won four awards, which remains the record for the most Oscars won in the same year. William Holden's speech for Best Actor for his role in \"Stalag 17\" was simply \"Thank You\", making it one of the shortest speeches"}, {"k": 1, "title": "Victor Young ", "text": " the record for most Oscar nominations before winning the first award. His other scores include \"Anything Goes\" (1936), \"The Big Broadcast of 1937\" (1936), \"Artists and Models\" (1937), \"The Gladiator\", \"Golden Boy\" (1939), \"For Whom the Bell Tolls\" (1943), \"The Uninvited\" (1944), \"Love Letters\" (1945), \"So Evil My Love\" (1948), \"The Emperor Waltz\" (1948), \"The Paleface\" (1948), \"Samson and Delilah\" (1949), \"A Connecticut Yankee in King Arthur's Court\" (1949), \"Our Very Own\" (1950), \"September Affair\" (1950), \"My Favorite Spy\" (1951), \"Payment on Demand\" (1951), \"The Quiet Man\" (1952), \"Scaramouche\" (1952), \"Something to Live For\" (1952), \"Shane\" (1953), \"The Country Girl\""}, {"k": 2, "title": "Frank Capra ", "text": " three times. He briefly held the record for winning the most Best Director Oscars when he won for the third time in 1938, until this record was matched by John Ford in 1941, and then later surpassed by Ford in 1952. William Wyler also matched this record upon winning his third Oscar in 1959. The Academy Film Archive has preserved two of Capra's films, \"The Matinee Idol\" (1928) and \"Two Down and One to Go!\" (1945). Frank Capra Frank Russell Capra (born Francesco Rosario Capra; May 18, 1897 – September 3, 1991) was an Italian American film director, producer and"}, {"k": 3, "title": "John Ford ", "text": " film left on the floor when I'm finished. Ford won a total of six Academy Awards. Four of these were for Best Director for \"The Informer\" (1935), \"The Grapes of Wrath\" (1940), \"How Green Was My Valley\" (1941), and \"The Quiet Man\" (1952)—none of them Westerns (also starring in the last two was Maureen O'Hara, \"his favorite actress\"). He was also nominated as Best Director for \"Stagecoach\" (1939). He won two Oscars for Best Documentary for \"The Battle of Midway\" and \"\". To this day Ford holds the record for winning the most Best Director Oscars, having won the award"}]}, "In golf, a six under par score has never been, and is unlikely to ever be recorded, as it requires a hole in one on a par-seven hole. What is the 'mythical' term for such a hypothetical performance? (hint: think about the names of under par scores)": {"answer_gt": "Phoenix", "answer_pred": " Double Albatross", "query": "In golf, a six under par score has never been, and is unlikely to ever be recorded, as it requires a hole in one on a par-seven hole. What is the 'mythical' term for such a hypothetical performance? (hint: think about the names of under par scores)", "docs": [{"k": 0, "title": "Par (score) ", "text": " history and the first to be televised and the first on Augusta's par-five second hole, Rafael Cabrera-Bello at the 2017 Players Championship, and Brooks Koepka at the 2018 Players Championship. Condor is an unofficial name for a score of four under par (−4). This is the lowest individual hole score ever made. A condor would be a hole-in-one on a par-five (typically by cutting over a dogleg corner), a two on a par-six or a three on a par-seven (neither of which has ever been achieved as of December 2016). Par-sixes are exceptionally rare, as are par-sevens. As of October"}, {"k": 1, "title": "Par (golf scoring format) ", "text": " reward or punishment due when a bogey 5 is recorded on a par 4. Thus, a 0 (zero) is recorded. A double-bogey 6 (one over what's expected from a player on a 9 handicap, would incur a penalty of a minus '−'. A 4 (a genuine, unadjusted par) is one better than a '9-handicapper' would be expected to score and would earn a plus '+'. However, for this golfer, 6s and above still incur just one minus '−'. Likewise, 4s and below earn just one plus '+'. At the end of the round, plusses and minuses are reconciled (a minus"}, {"k": 2, "title": "Par (score) ", "text": " 2008, a condor had been recorded only four times, once reportedly on a straight drive (a record , aided by the thin air at high altitude in Denver) and never during a professional tournament. One condor was reportedly achieved with a 3-iron club (in 1995 on a horseshoe-shaped par-5 hole). A condor is also known as a double albatross, or a triple eagle, and the convention can, in principle, be extended to name other hypothetical scores such as five under par. Par (score) In golf, par is the predetermined number of strokes that a scratch (or 0 handicap) golfer should"}, {"k": 3, "title": "Perfect round ", "text": " Perfect round In golf, a perfect round is a round of eighteen holes where all holes were played on average at one under par (average of birdie on every hole) resulting in a score of 55 on a par 73 course, 54 on a par 72 course, 53 on a par 71 course, and 52 on a par 70 course. The term 'perfect round' is used for a 54 as the lowest score generally accepted as being in the realm of possibility among professional golfers on a par 72 course. This has remained the standard and has never been achieved"}]}, "Who taught Eliza Dolittle to be a lady ?": {"answer_gt": "Professor Henry Higgins", "answer_pred": " Professor Henry Higgins", "query": "Who taught Eliza Dolittle to be a lady ?", "docs": [{"k": 0, "title": "My Fair Lady ", "text": " a hit London production, a popular film version, and many revivals. \"My Fair Lady\" has been called \"the perfect musical\". It is Edwardian London, the Royal Opera House, Covent Garden. The protagonist, Eliza Doolittle, is a Cockney with a thick, unintelligible accent. Professor Henry Higgins invites Colonel Pickering to stay as his houseguest. Soon after, Eliza Doolittle comes to Professor Higgins's house, seeking elocution lessons. Professor Higgins wagers Colonel Pickering, that in six months he will turn Eliza into a lady by teaching her to speak properly. Eliza is indentured into the Higgins household as a resident elocution student. After"}, {"k": 1, "title": "Eliza Doolittle ", "text": " Eliza Doolittle Eliza Doolittle is a fictional character from London who appears in the play \"Pygmalion\" (George Bernard Shaw, 1912) and the musical version of that play, \"My Fair Lady\". Eliza is a Cockney flower girl, who comes to Professor Henry Higgins asking for elocution lessons, after a chance encounter at Covent Garden. Higgins goes along with it for the purposes of a wager: That he can turn her into the toast of elite London society. Her Cockney dialect includes words that are common among working class Londoners, such as ain't; \"I ain't done nothing wrong by speaking to the"}, {"k": 2, "title": "Hildegarde Naughton ", "text": " Executive. She was teacher at St. Patrick's Boys School in Galway. She is a classically trained soprano, and in 2008 won the Association of Irish Musical Societies' Best Actress award for her role as Eliza Doolittle in the Galway Patrician Musical Society's production of \"My Fair Lady\". She speaks fluent French. She was co-ordinator of the 2007 Telethon People in Need Campaign for Galway City and County, which raised over €300,000 for local charities. Naughton surprised many by unseating party colleague John Mulholland at the 2009 local elections in the city's west electoral area (Salthill-Claddagh-Knocknacarra). John Cunningham suggested that personal"}, {"k": 3, "title": "My Fair Lady ", "text": " My Fair Lady My Fair Lady is a musical based on George Bernard Shaw's \"Pygmalion\", with book and lyrics by Alan Jay Lerner and music by Frederick Loewe. The story concerns Eliza Doolittle, a Cockney flower girl who takes speech lessons from professor Henry Higgins, a phoneticist, so that she may pass as a lady. The original Broadway and London shows starred Rex Harrison and Julie Andrews. The musical's 1956 Broadway production was a notable critical and popular success. It set a record for the longest run of any show on Broadway up to that time. It was followed by"}]}, "Which virus spread by fleas was deliberately introduced into Australia to control rabbits in 1951?": {"answer_gt": "Myxomatosis", "answer_pred": " Myxoma", "query": "Which virus spread by fleas was deliberately introduced into Australia to control rabbits in 1951?", "docs": [{"k": 0, "title": "Myxomatosis ", "text": " Myxomatosis Myxomatosis is a disease that affects rabbits, caused by the \"myxoma\" virus. It was first observed in Uruguay in laboratory rabbits in the late 19th century. It was introduced into Australia in 1950 in an attempt to control the rabbit population (see Rabbits in Australia). Affected rabbits develop skin tumors, and in some cases blindness, followed by fatigue and fever; they usually die within 14 days of contracting the disease. The disease is spread by direct contact with an affected animal or by being bitten by fleas or mosquitoes that have fed on an infected rabbit. The myxomatosis virus"}, {"k": 1, "title": "Animal virus ", "text": " susceptible to pox viruses, with symptoms characterised by widespread, unsightly skin lesions. And most people have heard of myxomatosis, which is a fatal pox virus infection of rabbits: once infected they die within twelve days. The virus was deliberately released in Australia in 1950, in an attempt to control the exponentially growing rabbit population. Rabbits had been brought to the continent in 1859 for sport, and having no natural predators, bred at an extraordinary rate. The infection killed 99.8 percent of rabbits, but by the late 1950s, Australian rabbits started to become immune to the virus and the population of"}, {"k": 2, "title": "Rabbits in Australia ", "text": " not wipe out whole populations might have raised doubts as to their efficacy. In 1950, following research conducted by Frank Fenner, myxoma virus was deliberately released into the rabbit population, causing it to drop from an estimated 600 million to around 100 million. Growing genetic resistance in the remaining rabbits had allowed the population to recover to 200–300 million by 1991. To combat that trend, over three years from June 1991, the Commonwealth Scientific and Industrial Research Organisation (CSIRO) comprehensively tested the potential of calicivirus, which causes rabbit haemorrhagic disease (RHD), for biological control of wild rabbits. The virus escaped"}, {"k": 3, "title": "Domestic rabbit ", "text": " 1952. The Australian government will not allow veterinarians to purchase and use the myxomatosis vaccine that would protect domestic rabbits, for fear that this immunity would be spread into the wild via escaped livestock and pets. This potential consequence is also one motivation for the pet-rabbit ban in Queensland. In Australia, rabbits caged outdoors in areas with high numbers of mosquitoes are vulnerable to myxomatosis. In Europe, fleas are the carriers of myxomatosis. In some countries, annual vaccinations against myxomatosis are available. Rabbit hemorrhagic disease (RHD), also known as \"viral hemorrhagic disease\" (VHD) or \"rabbit calicivirus disease\" (RCD), is caused"}]}, "Name either of the detectives created by Reginald Hill in novels such as 'A Pinch of Snuff' and 'Ruling Passions', who later featured in a popular TV series?": {"answer_gt": "DALZIEL & PASCOE", "answer_pred": " Dalziel and Pascoe", "query": "Name either of the detectives created by Reginald Hill in novels such as 'A Pinch of Snuff' and 'Ruling Passions', who later featured in a popular TV series?", "docs": [{"k": 0, "title": "A Pinch of Snuff ", "text": " A Pinch of Snuff A Pinch of Snuff is a crime novel by Reginald Hill, the fifth novel in the Dalziel and Pascoe series. Receiving a tip from his dentist Jack Shorter, Inspector Peter Pascoe takes a closer look at the Calliope Kinema Club, a film club notorious for showing adult entertainment movies. Shorter is convinced that one particular scene in a movie he recently saw was too realistic to have been staged with fake blood, but when Pascoe starts investigating, he soon comes across the actress in question, Linda Abbott, who obviously didn't suffer from any harm and assures"}, {"k": 1, "title": "Dalziel and Pascoe ", "text": " Dalziel and Pascoe Detective Superintendent Andrew \"Andy\" Dalziel and Detective Sergeant, later Detective Inspector, Peter Pascoe are two fictional Yorkshire detectives featuring in a series of novels by Reginald Hill. Dalziel is depicted as being rude, insensitive and blunt, whereas Pascoe is calm, polite and well mannered. Hill's mysteries often break with storytelling tradition. The novels employ various structural tricks, such as presenting parts of the story in non-chronological order, or alternating with sections from a novel supposedly written by Peter's wife, Ellie Pascoe (née Soper). The novella \"One Small Step\" is even set in the future, and deals with"}, {"k": 2, "title": "A Pinch of Snuff (TV series) ", "text": " A Pinch of Snuff (TV series) A Pinch of Snuff is a British television crime drama miniseries, consisting of three fifty-minute episodes, that broadcast on ITV network from 9 to 23 April 1994. The series, adapted from the novel of the same name by author Reginald Hill, was the first \"Dalziel and Pascoe\" adaptation for TV, arriving two years before the more widely-known and acclaimed BBC adaptation that followed in 1996. In this miniseries, the characters of Dalziel and Pascoe were played by comedians Gareth Hale and Norman Pace, with Christopher Fairbank as loyal sidekick Edgar Wield, and Malcolm Storry"}, {"k": 3, "title": "Joyce Porter ", "text": " Joyce Porter Joyce Porter (March 28, 1924 – December 9, 1990) was an English crime fiction author. Porter created the characters of \"Eddie Brown\", \"Constance Ethel Morrison Burke\", and \"Wilfred Dover\". In DCI Wilfred Dover and his assistant Sergeant MacGregor, she created a template later used successfully, especially by Reginald Hill, in straight 'whodunnits', but Porter's novels, while intricately plotted, were always played for laughs. Dover was obese, lazy, unhygienic (the only man in the Metropolitan Police Service with underarm dandruff) and bordering on corrupt. MacGregor was keen, clean and ferociously ambitious. However, on the rare occasions he was able"}]}, "What is the official march of the Royal Navy?": {"answer_gt": "Heart of Oak", "answer_pred": " \"Heart of Oak\"", "query": "What is the official march of the Royal Navy?", "docs": [{"k": 0, "title": "Heart of Oak ", "text": " Heart of Oak \"Heart of Oak\" is the official march of the Royal Navy of the United Kingdom. It is also the official march of several Commonwealth navies including the Royal Canadian Navy and the Royal New Zealand Navy. It was also the official march of the Royal Australian Navy, but has now been replaced by the new march, \"Royal Australian Navy.\" The music of \"Heart of Oak\" was composed by William Boyce, and the words were written by the 18th-century English actor David Garrick. \"Heart of Oak\" was originally written as part of an opera. It was first played"}, {"k": 1, "title": "3DB (Melbourne) ", "text": " the official march of the Royal Navy, the Royal Australian Navy and some other navies. By the 1960s 3DB was using a Columbia recording of the march, played by the Orchestra of the Royal Marines, conducted by Sir Vivian Dunn. The main news bulletins at 7.45am, 12.30pm and 7.00pm used the first 25 seconds of the theme, whilst other bulletins only used a smaller section. In 1930, test cricketer Don Bradman was a household name throughout Australia. There were even people who incorrectly believed that the call-sign 3DB was based on Bradman's initials. Bradman's popularity led to great interest in"}, {"k": 2, "title": "Royal Air Force March Past ", "text": " Royal Air Force March Past The \"Royal Air Force March Past\" is the official march of the Royal Air Force (RAF) and is used in some other Commonwealth air forces. The original score was completed by Walford Davies in 1918 for the new RAF; it combined the rhythm of the bugle call of the Royal Flying Corps with that of the Royal Naval Air Service. The call appears in both the introduction and the coda. It was originally known as the Adastral I (in reference to the RAF's motto). The second part of the march past, the trio, was composed"}, {"k": 3, "title": "Royal Air Force March Past ", "text": " the Trio section of the march (composed by George Dyson). It references the motto of the RAF, \"\"Per Ardua Ad Astra\"\" (Latin, \"Through adversity to the stars\"). Royal Air Force March Past The \"Royal Air Force March Past\" is the official march of the Royal Air Force (RAF) and is used in some other Commonwealth air forces. The original score was completed by Walford Davies in 1918 for the new RAF; it combined the rhythm of the bugle call of the Royal Flying Corps with that of the Royal Naval Air Service. The call appears in both the introduction and"}]}, "On which label did Chuck Berry record in the 1950s and 1960s?": {"answer_gt": "Chess", "answer_pred": " Chess Records", "query": "On which label did Chuck Berry record in the 1950s and 1960s?", "docs": [{"k": 0, "title": "Chuck Berry ", "text": " 1955 and met Muddy Waters, who suggested he contact Leonard Chess, of Chess Records. With Chess, he recorded \"Maybellene\"—Berry's adaptation of the country song \"Ida Red\"—which sold over a million copies, reaching number one on \"Billboard\" magazine's rhythm and blues chart. By the end of the 1950s, Berry was an established star, with several hit records and film appearances and a lucrative touring career. He had also established his own St. Louis nightclub, Berry's Club Bandstand. However, he was sentenced to three years in prison in January 1962 for offenses under the Mann Act—he had transported a 14-year-old girl across"}, {"k": 1, "title": "Chuck Berry ", "text": " state lines. After his release in 1963, Berry had several more hits, including \"No Particular Place to Go\", \"You Never Can Tell\", and \"Nadine\". But these did not achieve the same success, or lasting impact, of his 1950s songs, and by the 1970s he was more in demand as a nostalgic performer, playing his past hits with local backup bands of variable quality. However, in 1972 he reached a new level of achievement when a rendition of \"My Ding-a-Ling\" became his only record to top the charts. His insistence on being paid in cash led in 1979 to a four-month"}, {"k": 2, "title": "St. Louis to Liverpool ", "text": " St. Louis to Liverpool St. Louis to Liverpool is the seventh studio album and tenth album overall by rock and roll artist Chuck Berry, released in 1964 on Chess Records, catalogue number 1488. It peaked at number 124 on the \"Billboard\" album chart, the first of Berry's studio albums to appear on the chart. Music critic Dave Marsh named it \"one of the greatest rock & roll records ever made\". On October 18, 1963, Berry was released from prison after having spent 20 months incarcerated owing to conviction on a charge under the Mann Act. During his time in prison,"}, {"k": 3, "title": "1950s in music ", "text": " jump blues style of Joe Brown and Billy Wright. However, it wasn't until he prepared a demo in 1954, that caught the attention of Specialty Records, that the world would start to hear his new, uptempo, funky rhythm and blues that would catapult him to fame in 1955 and help define the sound of rock and roll. A rapid succession of rhythm-and-blues hits followed, beginning with \"Tutti Frutti\" and \"Long Tall Sally\", which would influence performers such as James Brown, Elvis Presley, and Otis Redding. At the urging of Leonard Chess at Chess Records, Chuck Berry had reworked a country"}]}, "\"Which British king, famous for his string of mistresses,said \"\"I do not believe God would damn a man for a little irregular pleasure\"\" ? He made pleasure-seeking an art form, &was keenly interested in theatre and horse-racing, and was the first monarch to have his own yacht.\"": {"answer_gt": "CHARLES II", "answer_pred": " Charles II", "query": "\"Which British king, famous for his string of mistresses,said \"\"I do not believe God would damn a man for a little irregular pleasure\"\" ? He made pleasure-seeking an art form, &was keenly interested in theatre and horse-racing, and was the first monarch to have his own yacht.\"", "docs": [{"k": 0, "title": "Gilbert Burnet ", "text": " young the \"baseness of human nature\". Like many other observers he noted Charles's remarkable self-control: \"he has a strange command of himself: he can pass from business to pleasure, and from pleasure to business, in so easy a manner that all things seem alike to him.\" He also recorded some of the King's most memorable sayings, such as \"Appetites are free, and Almighty God will never damn a man for allowing himself a little pleasure\". During the Popish Plot, when Queen Catherine was accused of treason, (it was alleged that she had conspired to murder her husband), the King confided"}, {"k": 1, "title": "Cabal ministry ", "text": " and as Kenyon remarks, they hardly dared turn their back on him for fear of sudden dismissal. It was said that the King treated his ministers very much as he did his mistresses: \"he used them, but he was not in love with them, and was tied to them no more than they to him\". Sir William Coventry, the Secretary to the Admiralty, resigned from office following a duel challenge from the Duke of Buckingham, and re-emerged in the House of Commons at the head of a group of MPs known as the \"Country Party\", which loudly opposed the Cabal"}, {"k": 2, "title": "Nell Gwyn ", "text": " perhaps apocryphal at this point: the King, after supper, discovered that he had no money on him; nor did his brother, and Gwyn had to foot the bill. \"Od's fish!\" she exclaimed, in an imitation of the King's manner of speaking, \"but this is the poorest company I ever was in!\" Having previously been the mistress of Charles Hart and Charles Sackville, Gwyn jokingly called the King \"her Charles the Third\". By mid-1668, Gwyn's affair with the King was well-known, though there was little reason to believe it would last for long. She continued to act at the King's House,"}, {"k": 3, "title": "Tregonwell Frampton ", "text": " peculiar uniformity in his dress, the fashion of which he never changed, and in which, regardless of its uncouth appearance, he would not unfrequently go to court and enquire in the most familiar manner for his master or mistress, the king or queen. Queen Anne used to call him Governor Frampton. Another writer quoted by Whyte in an account of Newmarket in the reign of Queen Anne, remarked: There was Mr. Frampton, the oldest, and, as they say, the cunningest jockey in England; one day he lost 1,000 guineas, the next he won 2,000, and so alternately. He made as"}]}, "Who wrote The Railway Children?": {"answer_gt": "Edith Nesbit", "answer_pred": " Edith Nesbit", "query": "Who wrote The Railway Children?", "docs": [{"k": 0, "title": "The Railway Children ", "text": " The Railway Children The Railway Children is a children's book by Edith Nesbit, originally serialised in \"The London Magazine\" during 1905 and first published in book form in 1906. It has been adapted for the screen several times, of which the 1970 film version is the best known. The \"Oxford Dictionary of National Biography\" credits Oswald Barron, who had a deep affection for Nesbit, with having provided the plot. The setting is thought to be inspired by Edith's walks to Chelsfield railway station close to where she lived, and her observing the construction of the railway cutting and tunnel between"}, {"k": 1, "title": "The Railway Children ", "text": " being a criminal. The Railway Children The Railway Children is a children's book by Edith Nesbit, originally serialised in \"The London Magazine\" during 1905 and first published in book form in 1906. It has been adapted for the screen several times, of which the 1970 film version is the best known. The \"Oxford Dictionary of National Biography\" credits Oswald Barron, who had a deep affection for Nesbit, with having provided the plot. The setting is thought to be inspired by Edith's walks to Chelsfield railway station close to where she lived, and her observing the construction of the railway cutting"}, {"k": 2, "title": "Railway Children (film) ", "text": " Railway Children (film) Railway Children is a 2016 Indian Kannada feature film written and directed by Prithvi Konanur. It is inspired from \"Rescuing Railway Children\" written by Lalitha Iyer and Malcolm Harper that describes the lives of children that run away from their homes, live in railway stations and trains, and grow up as criminals, despite their intentions being harmless and seeking only to earn a living. Produced by TinDrum Beats, the film featured mostly non-actors. The plot revolves around a 12-year-old runaway who falls into the hands of a gang involved in illegal businesses. Manohara K., Syed Pervez, Yash"}, {"k": 3, "title": "The Railway Children (1970 film) ", "text": " The Railway Children (1970 film) The Railway Children is a 1970 British drama film based on the novel of the same name by E. Nesbit. The film was directed by Lionel Jeffries, and stars Dinah Sheridan, Jenny Agutter (who had earlier featured in the successful BBC's 1968 dramatisation of the novel), Sally Thomsett and Bernard Cribbins in leading roles. The film was released to cinemas in the United Kingdom on 21 December 1970. The film rights were bought by Lionel Jeffries. It was his directorial debut, and he was also responsible for writing the screenplay for the film. \"The Railway"}]}, "Technically a shoal of fish becomes a school of fish when it is?": {"answer_gt": "Swimming in the same direction", "answer_pred": " shoal", "query": "Technically a shoal of fish becomes a school of fish when it is?", "docs": [{"k": 0, "title": "Shoaling and schooling ", "text": " from the group. Facultative shoalers, such as Atlantic cod, saiths and some carangids, shoal only some of the time, perhaps for reproductive purposes. Shoaling fish can shift into a disciplined and coordinated school, then shift back to an amorphous shoal within seconds. Such shifts are triggered by changes of activity from feeding, resting, travelling or avoiding predators. When schooling fish stop to feed, they break ranks and become shoals. Shoals are more vulnerable to predator attack. The shape a shoal or school takes depends on the type of fish and what the fish are doing. Schools that are travelling can"}, {"k": 1, "title": "Fish ", "text": " localised resource such as food or nesting sites is known simply as an \"aggregation\". When fish come together in an interactive, social grouping, then they may be forming either a \"shoal\" or a \"school\" depending on the degree of organisation. A \"shoal\" is a loosely organised group where each fish swims and forages independently but is attracted to other members of the group and adjusts its behaviour, such as swimming speed, so that it remains close to the other members of the group. \"Schools\" of fish are much more tightly organised, synchronising their swimming so that all fish move at"}, {"k": 2, "title": "Shoaling and schooling ", "text": " so as to remain close to the other fish in the group. Shoaling groups can include fish of disparate sizes and can include mixed-species subgroups. If the shoal becomes more tightly organised, with the fish synchronising their swimming so they all move at the same speed and in the same direction, then the fish may be said to be schooling. Schooling fish are usually of the same species and the same age/size. Fish schools move with the individual members precisely spaced from each other. The schools undertake complicated manoeuvres, as though the schools have minds of their own. The intricacies"}, {"k": 3, "title": "Fish ", "text": " the same speed and in the same direction. Shoaling and schooling behaviour is believed to provide a variety of advantages. Examples: While the words \"school\" and \"shoal\" have different meanings within biology, the distinctions are often ignored by non-specialists who treat the words as synonyms. Thus speakers of British English commonly use \"shoal\" to describe any grouping of fish, and speakers of American English commonly use \"school\" just as loosely. Fish Fish are gill-bearing aquatic craniate animals that lack limbs with digits. They form a sister group to the tunicates, together forming the olfactores. Included in this definition are the"}]}, "Who plays the role of Bubble in Absolutely Fabulous?": {"answer_gt": "Jane Horrocks", "answer_pred": " Jane Horrocks", "query": "Who plays the role of Bubble in Absolutely Fabulous?", "docs": [{"k": 0, "title": "Jane Horrocks ", "text": " became a name with the role of Bubble in \"Absolutely Fabulous\" (1992–2016). While working on \"Road\", a play directed by Jim Cartwright, Horrocks warmed up by doing singing impressions of Judy Garland, Shirley Bassey and Ethel Merman. Cartwright was so impressed with her mimicry he wrote \"The Rise and Fall of Little Voice\" for her. She was nominated for the Laurence Olivier Award for Best Actress for her performance in the 1992 West End production, directed by her boyfriend Sam Mendes. She reprised her role in the 1998 screen adaptation, \"Little Voice\", which earned nominations for the Golden Globe Award"}, {"k": 1, "title": "Jane Horrocks ", "text": " Jane Horrocks Barbara Jane Horrocks (born 18 January 1964) is an English actress, voice artist, musician and singer, who played the roles of Bubble and Katy Grin in the BBC sitcom \"Absolutely Fabulous\" (1992–2012). She was nominated for the 1993 Olivier Award for Best Actress for the title role in \"The Rise and Fall of Little Voice\", and received Golden Globe and BAFTA Award nominations when she reprised the role in the 1998 film \"Little Voice\". Her other film roles include \"The Witches\" (1990), \"Life Is Sweet\" (1990), \"Chicken Run\" (2000), \"Corpse Bride\" (2005) and \"Sunshine on Leith\" (2013). Horrocks,"}, {"k": 2, "title": "Absolutely Fabulous: The Movie ", "text": " and unable to find Bubble, they presume her dead, too. They decide to flee before the media firestorm gets worse, taking Lola and her credit card along. The three land in Cannes while Saffy desperately searches for Lola or clues to her whereabouts back in London, finally consulting Christopher (Chris Colfer), Edina's friend and stylist. In Cannes, Edina and Patsy call upon Patsy's ex-lover, billionaire Charlie (Barry Humphries). After Charlie rejects them, they seek help from Edina's mother (June Whitfield), who is celebrating her cousin Violet's birthday. During this party, they encounter the Richest Woman in the World. To attract"}, {"k": 3, "title": "Lancashire dialect ", "text": " early part of the 20th century, particularly those produced by Mancunian Films, often contain Lancashire dialect: the films of George Formby, Gracie Fields and Frank Randle are some examples. The 1990s sitcom Dinnerladies, written by comedian Victoria Wood who was brought up near Ramsbottom, used Lancashire accents, and the Accrington actress, Mina Anwar portrayed the Lancastrian police officer Habeeb in \"The Thin Blue Line\". 'Bubble', a character in 'Absolutely Fabulous' played by Jane Horrocks from Rawtenstall, speaks with a strong (Rossendale) Lancashire accent. The ninth incarnation of the titular character of \"Doctor Who\", played by Salford native and actor Christopher"}]}, "On which island was the famous photograph taken showing US Marines raising the US flag over Mt Suribachi in February 1945?": {"answer_gt": "Iwo Jima", "answer_pred": " Iwo Jima", "query": "On which island was the famous photograph taken showing US Marines raising the US flag over Mt Suribachi in February 1945?", "docs": [{"k": 0, "title": "Raising the Flag on Iwo Jima ", "text": " Raising the Flag on Iwo Jima Raising the Flag on Iwo Jima is an iconic photograph taken by Joe Rosenthal on February 23, 1945, which depicts six United States Marines raising a U.S. flag atop Mount Suribachi, during the Battle of Iwo Jima, in World War II. The photograph was first published in Sunday newspapers on February 25, 1945. It was extremely popular and was reprinted in thousands of publications. Later, it became the only photograph to win the Pulitzer Prize for Photography in the same year as its publication, and came to be regarded in the United States as"}, {"k": 1, "title": "Iwo Jima ", "text": " beachhead was the taking of Mount Suribachi. At the second raising of a flag on the peak, Joe Rosenthal photographed six Marines raising the United States flag on the fourth day of the battle (February 23). The photograph was extremely popular, and won the Pulitzer Prize for Photography that same year. It is regarded as one of the most significant and recognizable images of the war. After the fall of Mount Suribachi in the south, the Japanese still held a strong position throughout the island. General Tadamichi Kuribayashi still had the equivalent of eight infantry battalions, a tank regiment, two"}, {"k": 2, "title": "Raising the Flag on Iwo Jima ", "text": " February 23, four days after the battle began. Despite capturing Suribachi, the battle continued to rage for many days, and the island would not be declared \"secure\" until 31 days later, on March 26. There were two American flags raised on top of Mount Suribachi, on February 23, 1945. The photograph Rosenthal took was actually of the second flag-raising in which a larger replacement flag was raised by Marines who did not raise the first flag. A U.S. flag was first raised atop Mount Suribachi soon after the mountaintop was captured at around 10:20 on February 23, 1945. Lieutenant Colonel"}, {"k": 3, "title": "Iwo Jima ", "text": " the Battle of Iwo Jima between February 1945–March 1945. The island became globally recognized when Joe Rosenthal, who worked for the Associated Press at the time, published his photograph \"Raising the Flag on Iwo Jima\" which was photographed on Mount Suribachi. The US military occupied Iwo Jima until 1968, when it was returned to Japan. The first European to arrive at Iwo Jima was Spanish sailor Bernardo de la Torre who named it Sufre Island, after the old Spanish term for sulphur (\"azufre\" in modern Spanish). At that time Iwo Jima and other islands were the limit betweenthe Spanish and"}]}, "A mill in Woodbridge, Suffolk, England, built in the 12th century, reconstructed in 1792, further restored in 2010 and currently in full working order is a early English example of a mill powered by what?": {"answer_gt": "Tide", "answer_pred": " Wind", "query": "A mill in Woodbridge, Suffolk, England, built in the 12th century, reconstructed in 1792, further restored in 2010 and currently in full working order is a early English example of a mill powered by what?", "docs": [{"k": 0, "title": "Tide mill ", "text": " Dover harbour. By the 18th century, there were about 76 tide mills in London, including two on London Bridge. Woodbridge Tide Mill, an excellent example, survives at Woodbridge, Suffolk, England. This mill, dating from 1170 and reconstructed in 1792, has been preserved and is open to the public. It was further restored in 2010 and re-opened in 2011 in full working order. It is the second working tide mill in the United Kingdom that is regularly producing flour. Carew Castle in Wales also has an intact tide mill, but it is not operating. The first tide mill to be restored"}, {"k": 1, "title": "Buttrum's Mill, Woodbridge ", "text": " Buttrum's Mill, Woodbridge Buttrum's Mill or Trott's Mill is a Grade II listed tower mill at Woodbridge, Suffolk, England which has been restored to working order. Buttrum's Mill was built in 1836 by John Whitmore, the Wickham Market millwright, replacing an earlier post mill. The mill was run for many years by the Trott family, for whom it was built, and later by the Buttrum family. It worked by wind until 11 October 1928. The shutters were removed from the sails in 1934 and stored in the mill. The mill was bought at auction in 1937 by Mr Kenney, a"}, {"k": 2, "title": "Woodbridge Tide Mill ", "text": " the seventeenth century. This is the mill preserved today. By the outbreak of World War II the mill was one of only a handful still operating. In 1957 it closed as the last commercially operating tide mill in Britain. In 1968 the derelict mill was purchased by Mrs Jean Gardner and a restoration programme was launched. It was opened to the public five years later in 1973. It is now managed by a charitable trust (Woodbridge Tide Mill Trust) staffed by volunteers, and in 2011 the trust undertook a further and more complete restoration and modernisation project, including a new"}, {"k": 3, "title": "Saxtead Green Windmill ", "text": " Saxtead Green Windmill Saxtead Green Post Windmill is a Grade II* listed post mill at Saxtead Green, Woodbridge, Suffolk, England which is also an Ancient Monument and has been restored. According to the Manorial Records there has been a windmill in Saxtead since 1287. The current \"Saxtead Green Mill\" dates back to at least 1796 when the miller was Amos Webber. In 1810, the Mill House was built for Robert Holmes. The mill was raised a total of three times during its working life. The mill was tailwinded c. 1853. Around this time, the sails were destroyed and remade but"}]}, "Moon River is an Oscar winning song from which movie?": {"answer_gt": "Breakfast At Tiffany's", "answer_pred": " 1961", "query": "Moon River is an Oscar winning song from which movie?", "docs": [{"k": 0, "title": "Moon River ", "text": " Moon River \"Moon River\" is a song composed by Henry Mancini with lyrics by Johnny Mercer. It was originally performed by Audrey Hepburn in the 1961 movie \"Breakfast at Tiffany's\", winning an Academy Award for Best Original Song. The song also won the 1962 Grammy Awards for Record of the Year and Song of the Year. The song has been covered by many other artists. It became the theme song for Andy Williams, who first recorded it in 1962 (and performed it at the Academy Awards ceremony that year). He sang the first eight bars of the song at the"}, {"k": 1, "title": "Moon River and Other Great Movie Themes ", "text": " of an entire album of songs from movies, and he wound up recording the rejected song on January 4, 1962. A few months later he was again offered the chance to sing \"Moon River\", this time at the Academy Awards on April 9 because of its nomination for Best Original Song. The April 28 issue of \"Billboard\" magazine reported that the album had \"racked up orders, according to Columbia Records, of close to 40,000 within two weeks' release. Platter was rushed out by the label to coincide with Williams' performance of the Mancini tune on the Academy Awards Show a"}, {"k": 2, "title": "Andy Williams ", "text": " was a chart success, peaking at No. 19. He was then asked to sing \"Moon River\", the theme from \"Breakfast at Tiffany's\", at the 1962 Academy Awards, where it won Best Original Song. Archie Bleyer at Cadence had previously told Williams that \"Moon River\" would not be a hit, but the Columbia producers encouraged Andy to record the song along with eleven other movie themes for an album. After Williams performed the song at the awards show, it became a hit. \"Moon River and Other Great Movie Themes\" then sold across the country, garnering critical acclaim and propelling Williams into"}, {"k": 3, "title": "Moon River ", "text": " have covered the song include Rod Stewart in \"Fly Me to the Moon... The Great American Songbook Volume V\" (2010), which charted at No. 4 on the Billboard 200, and Barbra Streisand in \"The Movie Album\" (2003), a Grammy-nominated gold album. Diffuser.fm named these the \"Top 5 Alt-Rock\" versions of the song: The Killers, Glasvegas, R.E.M., Morrissey and Josh Ritter. Moon River \"Moon River\" is a song composed by Henry Mancini with lyrics by Johnny Mercer. It was originally performed by Audrey Hepburn in the 1961 movie \"Breakfast at Tiffany's\", winning an Academy Award for Best Original Song. The song"}]}, "In the TV sit-com 'Red Dwarf', what was the name of the ship's sentient computer?": {"answer_gt": "'HOLLY'", "answer_pred": " Holly", "query": "In the TV sit-com 'Red Dwarf', what was the name of the ship's sentient computer?", "docs": [{"k": 0, "title": "Spacecraft in Red Dwarf ", "text": " (Search for Intelligent Universe station) was a research facility appearing in the episode \"Krysis\" (2016). Located in the depths of deep space, the S.I.U. station intended to prove the theory that the Universe was a sentient entity and to establish contact with it. The Oregon is mentioned by Captain Hollister in \"The End\" (1988), citing example of a ship that had experienced an animal quarantine related incident, apparently involving rabbits. The SS \"Scott Fitzgerald\" is mentioned in the episode \"Better Than Life\" (1988). It is the ship to which the 11th generation AI computer Gordon resides. The SS \"Augustus\" is"}, {"k": 1, "title": "Kryten (Red Dwarf) ", "text": " Kryten (Red Dwarf) \"Kryten\" is the seventh episode from science fiction sit-com \"Red Dwarf\", the first from series two, and was first broadcast on BBC2 on 6 September 1988. Written by Rob Grant and Doug Naylor, and directed by Ed Bye, this episode introduced the mechanoid character Kryten. The episode was re-mastered, along with the rest of the first three series, in 1998. \"Red Dwarf\" receives a distress call from a crashed spaceship, the \"Nova 5\". As usual, Rimmer (Chris Barrie) claims this to be aliens. But according to the on-board service mechanoid that sent the distress call, Kryten (David"}, {"k": 2, "title": "The End (Red Dwarf) ", "text": " eulogy. One of the more drastic changes was the ship's computer, Holly. Initially shot as a voice over, Norman Lovett had convinced the creators to have a disembodied head on screen. The Holly scenes from the first three episodes were re-edited to feature the newly shot lines with the head of Holly. Altogether, approximately two-thirds of the broadcast episode was composed of reshoot footage. Set designer Paul Montague gave the ship interiors a grey submarine look. Walls, floors, bunks, cans and even cigarette packets were coloured grey. The \"Welcome Back George McIntyre\" reception featured bright red plastic chairs, which had"}, {"k": 3, "title": "Queeg (Red Dwarf) ", "text": " Rimmer thinks it's aliens, but he introduces himself as Queeg 500, the \"Red Dwarf\" back-up computer. According to Queeg he is to replace Holly for gross negligence leading to the endangerment of personnel, and assumes control of the ship, demoting Holly to night watchman. The crew are initially pleased at the intelligence and efficiency of the new computer. However, the next morning Queeg forces Rimmer out of bed early to do exercises. While Lister originally enjoys watching Rimmer getting worked to exhaustion, he gets a nasty shock when he and the Cat are put to work scrubbing the ship, as"}]}, "Which film starring Steve McQueen featured a car chase through the streets of San Francisco?": {"answer_gt": "Bullitt", "answer_pred": " Bullitt", "query": "Which film starring Steve McQueen featured a car chase through the streets of San Francisco?", "docs": [{"k": 0, "title": "Steve McQueen ", "text": " which he stars opposite Candice Bergen and Richard Attenborough (with whom he had previously worked in \"The Great Escape\"). He followed his Oscar nomination with 1968's \"Bullitt\", one of his best-known films, which co-starred Jacqueline Bisset, Robert Vaughn, and Don Gordon. It featured an unprecedented (and endlessly imitated) auto chase through San Francisco. Although McQueen did do the driving that appeared in closeup, this was about 10% of what is seen in the film's car chase. The rest of the driving by McQueen's character was done by stunt drivers Bud Ekins and Loren Janes. The antagonist's black was driven by"}, {"k": 1, "title": "Dodge Charger (B-body) ", "text": " framing two thick ones). The stripes were standard on the R/Ts and came in red, white, or black, but could be deleted at no extra cost. The 1968 film Bullitt helped popularize the Charger R/T for its notable car chase sequence alongside the titular character's 1968 Ford Mustang GT through the streets of San Francisco, which has been regarded as one of the most influential car chase scenes in movie history. In the film, a black Dodge Charger R/T 440 is chased by Steve McQueen's Ford Mustang GT, jumping on the San Francisco slopes. The 1968 model year Charger sales"}, {"k": 2, "title": "Bill Hickman ", "text": " parts throughout the 1950s and 1960s, he mostly paid his bills with his stuntman work. He sustained a couple of significant injuries during this time, including breaking several ribs in a bad trick-fall in the film \"How to Stuff a Wild Bikini\" (1965). However, it was the landmark car chase alongside Steve McQueen in the now classic 1968 film \"Bullitt\" for which he is usually remembered. Hickman was to do all his own driving; portraying one of two hit men, he drove an all black 1968 Dodge Charger 440 Magnum R/T through the streets of San Francisco, using the hills"}, {"k": 3, "title": "Double clutch (technique) ", "text": " chase in the 1968 police thriller \"Bullitt\", in which the police detective played by Steve McQueen, driving a green Ford Mustang GT 390, chases hit men in a 1968 Dodge Charger 440 R/T (automatic transmission) through the streets of San Francisco. McQueen is shown double clutching on most shifts. Double clutching may not have actually happened that many times. Many racing enthusiasts consider double clutching a synchronized transmission a waste of time. However the chase footage, as edited, makes it appear so. Apart from acting, McQueen was also an avid race car and motorcycle enthusiast. Double clutch (technique) Double clutching"}]}, "What was the first name of the character played by John Travolta in Saturday Night Fever.": {"answer_gt": "Tony (Manero).", "answer_pred": " Tony", "query": "What was the first name of the character played by John Travolta in Saturday Night Fever.", "docs": [{"k": 0, "title": "Saturday Night Fever ", "text": " the film and recreates the opening scene and classic characters from the film who are portrayed by each band member. Saturday Night Fever Saturday Night Fever is a 1977 American musical drama film directed by John Badham. It stars John Travolta as Tony Manero, a working-class young man who spends his weekends dancing and drinking at a local Brooklyn discothèque; Karen Lynn Gorney as Stephanie Mangano, his dance partner and eventual confidante; and Donna Pescow as Annette, Tony's former dance partner and would-be girlfriend. While in the disco, Tony is the champion dancer. His circle of friends and weekend dancing"}, {"k": 1, "title": "Saturday Night Fever ", "text": " Saturday Night Fever Saturday Night Fever is a 1977 American musical drama film directed by John Badham. It stars John Travolta as Tony Manero, a working-class young man who spends his weekends dancing and drinking at a local Brooklyn discothèque; Karen Lynn Gorney as Stephanie Mangano, his dance partner and eventual confidante; and Donna Pescow as Annette, Tony's former dance partner and would-be girlfriend. While in the disco, Tony is the champion dancer. His circle of friends and weekend dancing help him to cope with the harsh realities of his life: a dead-end job, clashes with his unsupportive and squabbling"}, {"k": 2, "title": "Saturday Night Fever ", "text": " both appeared in minor roles in the beginning of the film. Travolta's sister is the pizzeria waitress who serves him the pizza slices (and delivers the first dialogue), and his mother plays the woman to whom he sells the can of paint (after being late). John G. Avildsen was signed to direct but was fired three weeks prior to principal photography over a script dispute with producer Robert Stigwood. Despite this, Travolta's character has a \"Rocky\" poster in his room, a film directed by Avildsen. According to the DVD commentary for \"Saturday Night Fever\", the producers intended to use the"}, {"k": 3, "title": "Neri Parenti ", "text": " insolito destino (John Travolto [overwhelmed] ... by an unusual destiny)\", an ironic and comical imitation of \"Saturday Night Fever\" with John Travolta, which had been a hit two years earlier. A year later he met the film actor and director Paolo Villaggio, who was then filming \"Fantozzi contro tutti (Fantozzi against all)\". Villaggio developed an esteem for Parenti and decided to leave the director’s chair to join forces with him. The result was very positive and the pair made another six films with the Fantozzi character, from \"Fantozzi subisce ancora (Fantozzi still suffers)\" (1983) to \"Fantozzi - Il ritorno (Fantozzi"}]}, "Maria Dickin was the founder of which British animal charity in 1917?": {"answer_gt": "Peoples Dispensary for Sick Animals", "answer_pred": " PDSA", "query": "Maria Dickin was the founder of which British animal charity in 1917?", "docs": [{"k": 0, "title": "Maria Dickin ", "text": " Maria Dickin Maria Elisabeth Dickin CBE (nickname, Mia; 22 September 1870 – 1 March 1951) was a social reformer and an animal welfare pioneer who founded the People's Dispensary for Sick Animals (PDSA) in 1917. Born in 1870 in London, she was the oldest of eight children; her parents were William George Dickin, a Wesleyan minister, and Ellen Maria (née Exell). She married her first cousin, Arnold Francis Dickin, an accountant, in 1899; they had no children. She enjoyed music, literary work and philanthropy. Dickin died in London in 1951 of influenzal broncho-pneumonia. The Dickin Medal is named after her."}, {"k": 1, "title": "Maria Dickin ", "text": " A commemorative blue plaque was erected by English Heritage at Dickin's birthplace, 41 Cassland Road (formerly 1 Farringdon Terrace) in Hackney in October 2015. Maria Dickin Maria Elisabeth Dickin CBE (nickname, Mia; 22 September 1870 – 1 March 1951) was a social reformer and an animal welfare pioneer who founded the People's Dispensary for Sick Animals (PDSA) in 1917. Born in 1870 in London, she was the oldest of eight children; her parents were William George Dickin, a Wesleyan minister, and Ellen Maria (née Exell). She married her first cousin, Arnold Francis Dickin, an accountant, in 1899; they had no"}, {"k": 2, "title": "People's Dispensary for Sick Animals ", "text": " People's Dispensary for Sick Animals The People's Dispensary for Sick Animals (PDSA) is a veterinary charity in the United Kingdom. It was founded in 1917 by Maria Dickin to provide care for sick and injured animals of the poor. It is the UK's leading veterinary charity, carrying out more than one million free veterinary consultations a year, and was up to 2009 the largest private employer of fully qualified veterinary surgeons and veterinary nurses in the UK but you can only use the services of this national charity if you live in one of their catchment areas. During World War"}, {"k": 3, "title": "Dickin Medal ", "text": " Cross Trust has opposed this association). Maria Dickin was the founder of the People's Dispensary for Sick Animals (PDSA), a British veterinary charity. She established the award for any animal displaying conspicuous gallantry and devotion to duty whilst serving with British Empire armed forces or civil emergency services. The medal was awarded 54 times between 1943 and 1949 – to 32 pigeons, 18 dogs, 3 horses, and a ship's cat – to acknowledge actions of gallantry or devotion during the Second World War and subsequent conflicts. The awarding of the medal was revived in 2000 to honour Gander, a Newfoundland"}]}, "Which river flows from northern Moscow to the Caspian Sea?": {"answer_gt": "Volga", "answer_pred": " Volga", "query": "Which river flows from northern Moscow to the Caspian Sea?", "docs": [{"k": 0, "title": "Moskva River ", "text": " Moskva River The Moskva River (, \"Moskva-reka\") is a river of western Russia. It rises about west of Moscow, and flows roughly east through the Smolensk and Moscow Oblasts, passing through central Moscow. About south east of Moscow, at the city of Kolomna, it flows into the Oka River, itself a tributary of the Volga, which ultimately flows into the Caspian Sea. \"Moskva\" and \"Moscow\" are two different renderings of the same Russian word \"Москва\". The city is named after the river. Finno-Ugric Merya and Muroma people, who originally inhabited the area, called the river \"Mustajoki\". It has been suggested"}, {"k": 1, "title": "Moskva River ", "text": " Moskva River The Moskva River (, \"Moskva-reka\") is a river of western Russia. It rises about west of Moscow, and flows roughly east through the Smolensk and Moscow Oblasts, passing through central Moscow. About south east of Moscow, at the city of Kolomna, it flows into the Oka River, itself a tributary of the Volga, which ultimately flows into the Caspian Sea. \"Moskva\" and \"Moscow\" are two different renderings of the same Russian word \"Москва\". The city is named after the river. Finno-Ugric Merya and Muroma people, who originally inhabited the area, called the river \"Mustajoki\". It has been suggested"}, {"k": 2, "title": "Terek River ", "text": " Terek River The Terek River (; , ; , ; , \"Terk\"; , ; , ), a major river in the Northern Caucasus, flows through Georgia and Russia into the Caspian Sea. It rises in Georgia near the juncture of the Greater Caucasus Mountain Range and the Khokh Range, to the southwest of Mount Kazbek, winding north in a white torrent between the town of Stepantsminda and the village of Gergeti toward the Russian region North Ossetia and the city of Vladikavkaz. It turns east to flow through Chechnya and Dagestan before dividing into two branches which empty into the"}, {"k": 3, "title": "Volga River ", "text": " dimensions can travel from the Caspian Sea almost to the upstream end of the river. Connections with the river Don and the Black Sea are possible through the Volga–Don Canal. Connections with the lakes of the North (Lake Ladoga, Lake Onega), Saint Petersburg and the Baltic Sea are possible through the Volga–Baltic Waterway; and commerce with Moscow has been realised by the Moscow Canal connecting the Volga and the Moskva River. This infrastructure has been designed for vessels of a relatively large scale (lock dimensions of on the Volga, slightly smaller on some of the other rivers and canals) and"}]}, "What hero from Greek mythology was killed by a discus thrown by Apollo, who then named a flower after him, made from his spilled blood?": {"answer_gt": "Hyacinth", "answer_pred": " Hyacinthus", "query": "What hero from Greek mythology was killed by a discus thrown by Apollo, who then named a flower after him, made from his spilled blood?", "docs": [{"k": 0, "title": "Apollo ", "text": " to die in the wild, Apollo asked Hermes to save the child and bring him to the oracle at Delphi, where he was raised by a priestess. Hyacinth or Hyacinthus was Apollo's favorite lover. He was a Spartan prince, beautiful and athletic. The pair was practicing throwing the discus when the discus thrown by Apollo was blown off course by the jealous Zephyrus and struck Hyacinthus in the head, killing him instantly. Apollo is said to be filled with grief: out of Hyacinthus' blood, Apollo created a flower named after him as a memorial to his death, and his tears"}, {"k": 1, "title": "Hyacinthus orientalis ", "text": " succulent texture, and produced in a basal whorl. The flowering stem is a raceme, which grows to 20–35 cm (rarely to 45 cm) tall, bearing 2–50 fragrant purple flowers 2–3.5 cm long with a tubular, six-lobed perianth. In Greek mythology, Hyakinthos was a young man admired by Apollo and Zephyr, but killed by a discus in a jealous fight between the two gods; a flower was allegedly named after him when it sprang from his blood. However, Theophrastus describes both a cultivated and a wild plant called ὑάκινθος (hyakinthos), neither of which are considered to be the modern hyacinth. The"}, {"k": 2, "title": "Hyacinth House ", "text": " of the term Hyacinth is thought to be Morrison's way of expressing his unhappiness. Further, Hyacinthus was a beautiful youth and lover of the Greek god Apollo. According to the myth, Apollo accidentally killed Hyacinthus in a discus throwing contest when the latter ran to catch Apollo's discus in an effort to impress the god. After the unfortunate death, Apollo refused to let Hades claim the youth. Rather, from Hyacinthus' blood, Apollo created the hyacinth, a plant with a fragrant cluster of flowers. This interpretation of \"Hyacinth House\" is furthermore based on the song's lyrical reference to another Doors' song,"}, {"k": 3, "title": "The Death of Hyacinthos ", "text": " the plaster model by Callamard) represents the death of Hyacinthos, Apollo’s favorite, while playing discus with the god. The young man is struck with a fatal blow; he is dying in Apollo’s arms, who changes him into the flower that bears his name (see previously referenced page). Egyptian mythology, on which the Greeks probably founded their entire religious system, tells us that Apollo, son of Zeus, was gifted with extraordinary beauty, such that the sun was named after him. This prince, who was equally commendable for his spiritual qualities as for his external beauty, was the first to teach science"}]}, "What is the historical subject matter of Arthur Miller’s 1953 play The Crucible?": {"answer_gt": "Salem Witch Trials", "answer_pred": " Allegory for McCarthyism", "query": "What is the historical subject matter of Arthur Miller’s 1953 play The Crucible?", "docs": [{"k": 0, "title": "The Crucible ", "text": " The Crucible The Crucible is a 1953 play by American playwright Arthur Miller. It is a dramatized and partially fictionalized story of the Salem witch trials that took place in the Massachusetts Bay Colony during 1692/93. Miller wrote the play as an allegory for McCarthyism, when the United States government persecuted people accused of being communists. Miller himself was questioned by the House of Representatives' Committee on Un-American Activities in 1956 and convicted of contempt of Congress for refusing to identify others present at meetings he had attended. The play was first performed at the Martin Beck Theatre on Broadway"}, {"k": 1, "title": "The Crucible (opera) ", "text": " trials. The Arthur Miller play on which it was based was written as an allegory for McCarthyism and the Red Scare, which occurred in the United States in the 1950s. Miller was himself questioned by the House Committee on Un-American Activities in 1956. Several women and men in the town are accused of witchcraft by a group of young girls led by Abigail Williams. Her jealousy of John Proctor's wife, Elizabeth, leads Abigail to accuse Elizabeth of witchcraft. John himself is eventually accused and hangs rather than recant, saying he can't dirty his name and stands up for what he"}, {"k": 2, "title": "Arthur Miller ", "text": " with Kazan about his testimony, Miller traveled to Salem, Massachusetts to research the witch trials of 1692. \"The Crucible\", in which Miller likened the situation with the House Un-American Activities Committee to the witch hunt in Salem in 1692, opened at the Beck Theatre on Broadway on January 22, 1953. Though widely considered only somewhat successful at the time of its release, today \"The Crucible\" is Miller's most frequently produced work throughout the world. It was adapted into an opera by Robert Ward in 1961. Miller and Kazan were close friends throughout the late 1940s and early 1950s, but after"}, {"k": 3, "title": "The Crucible ", "text": " of suspicion as a left-wing intellectual during his exile in the US. In 1947 Feuchtwanger wrote a play about the Salem witch trials, ' (\"Delusion, or The Devil in Boston\"), as an allegory for the persecution of communists, thus anticipating the theme of \"The Crucible\" by Arthur Miller; ' premiered in Germany in 1949. It was translated by June Barrows Mussey and performed in Los Angeles in 1953 under the title \"The Devil in Boston\". Original 1953 Broadway cast: In June 1953 Miller recast the production, simplified the \"pitiless sets of rude buildings\" and added a scene. <poem> Boo Alexander"}]}, "What is the surname of the TV sibling characters Chris, Meg and Stewie (and pet Brian)?": {"answer_gt": "GRIFFIN", "answer_pred": " Griffin", "query": "What is the surname of the TV sibling characters Chris, Meg and Stewie (and pet Brian)?", "docs": [{"k": 0, "title": "Stewie Griffin ", "text": " Griffin family appeared in the episode \"Death Has a Shadow\". An infant who acts in an adult way, Stewie was initially obsessed with violence and matricide. He is the youngest child of Peter and Lois Griffin, and the youngest brother of Meg and Chris. Over the duration of the series, the violent aspects of Stewie's personality have been toned down, and he has evolved into an eccentric, friendly and flamboyant character. He has also come to have a very close friendship with the family's anthropomorphic dog, Brian. Stewie is considered to be the show's breakout character. \"Wizard\" magazine rated him"}, {"k": 1, "title": "Family Guy ", "text": " Pewterschmidt family; Meg, their often-bullied teenage daughter who is also constantly ridiculed or ignored by the family; Chris, their awkward teenage son, who is overweight, unintelligent and, in many respects, is simply a younger version of his father; and Stewie, their diabolical infant son of ambiguous sexual orientation who has adult mannerisms and uses stereotypical archvillain phrases. Living with the family is their witty, smoking, martini-swilling, sarcastic, English-speaking anthropomorphic dog Brian, though he is still considered a pet in many ways. Recurring characters appear alongside the Griffin family. These include the family's neighbors: sex-crazed airline pilot bachelor Quagmire; African-American deli"}, {"k": 2, "title": "Family Guy ", "text": " Family Guy Family Guy is an American animated sitcom created by Seth MacFarlane for the Fox Broadcasting Company. The series centers on the Griffins, a family consisting of parents Peter and Lois; their children, Meg, Chris, and Stewie; and their anthropomorphic pet dog, Brian. The show is set in the fictional city of Quahog, Rhode Island, and exhibits much of its humor in the form of metafictional cutaway gags that often lampoon American culture. The family was conceived by MacFarlane after developing two animated films, \"The Life of Larry\" and \"Larry & Steve\". MacFarlane redesigned the films' protagonist, Larry, and"}, {"k": 3, "title": "North by North Quahog ", "text": " a second honeymoon to enliven their marriage, and leave their anthropomorphic dog Brian to take care of their children Stewie, Chris, and Meg. Brian is unable to control the children, but Stewie offers to help (in exchange for Brian changing his diaper) and together they manage the home. The pair chaperone a dance at Chris's school, during which the school principal catches Chris in the boys' restroom with vodka that belongs to his classmate Jake Tucker. Although Brian and Stewie punish Chris by grounding him, they try to clear his name. Jake's father Tom refuses to believe Brian and Stewie,"}]}, "Caroline of Brunswick was the queen consort of which British King?": {"answer_gt": "GEORGE IV", "answer_pred": " George IV", "query": "Caroline of Brunswick was the queen consort of which British King?", "docs": [{"k": 0, "title": "Caroline of Brunswick ", "text": " Caroline of Brunswick Caroline of Brunswick (Caroline Amelia Elizabeth; 17 May 1768 – 7 August 1821) was Queen consort of the United Kingdom as the wife of King George IV from 29 January 1820 until her death in 1821. She was the Princess of Wales from 1795 to 1820. Her father, Charles William Ferdinand, was the ruler of Brunswick-Wolfenbüttel in Germany, and her mother, Augusta, was the sister of the British king George III. In 1794, she was engaged to her first cousin and George III's eldest son, George, despite the two of them never having met and George already"}, {"k": 1, "title": "Lady of the Bedchamber ", "text": " British Royal Household. Anne of Denmark was Queen Consort to James I of England. Henrietta Maria was Queen Consort to Charles I of England. Catherine of Braganza was Queen Consort to Charles II of England Mary of Modena was Queen Consort to James II of England Caroline of Ansbach was Queen Consort to George II of Great Britain Princess Augusta was the wife of Frederick, Prince of Wales Charlotte of Mecklenberg-Strelitz was Queen Consort to King George III of Great Britain Caroline of Brunswick was the wife of George, Prince of Wales, Prince Regent and from 1820 Queen Consort to"}, {"k": 2, "title": "Pains and Penalties Bill 1820 ", "text": " of Wales, the eldest son of King George III, married Duchess Caroline of Brunswick-Wolfenbüttel. The marriage, however, was disastrous; each party was unsuited to the other. They separated after the birth of their only child, Princess Charlotte of Wales, the following year. Caroline eventually departed England for the European mainland. On the death of George III on 29 January 1820, George became king as George IV, and Caroline became queen consort. However, George IV refused to recognise Caroline as queen, and commanded British ambassadors to ensure that monarchs in foreign courts did the same. Her name was omitted from the"}, {"k": 3, "title": "Caroline Matilda of Great Britain ", "text": " of Brunswick-Lüneburg, who was also divorced and exiled. Caroline Matilda of Great Britain Caroline Matilda of Great Britain (; 22 July 1751 – 10 May 1775) was by birth a Princess of Great Britain and member of the House of Hanover and by marriage Queen consort of Denmark and Norway from 1766 to 1772. The youngest and posthumous daughter of Frederick, Prince of Wales, by Princess Augusta of Saxe-Gotha, Caroline Matilda was raised in a secluded family atmosphere away from the royal court. At the age of fifteen, she was married to her first cousin, King Christian VII of Denmark"}]}, "Which football league championship side plays home games at Keepmoat Stadium?": {"answer_gt": "DONCASTER ROVERS", "answer_pred": " Doncaster Mustangs", "query": "Which football league championship side plays home games at Keepmoat Stadium?", "docs": [{"k": 0, "title": "2007 BAFL season ", "text": " 2007 BAFL season The 2007 BAFL Season is the British American Football League. BritBowl XXI, the league's championship game, was scheduled to be played at Keepmoat Stadium in Doncaster on September 23, 2007. Based on the British American Football League, setup for the 2007 season there will be a 3 tier structure consisting of: \"W = Wins, L = Losses, T = Ties, PCT = Winning Percentage, PF= Points For, PA = Points Against\" \"Clinched playoff seeds are marked in parentheses and shaded in green, for BAFL 2 divisions the colours have been changed to indicate Northern and Southern sides"}, {"k": 1, "title": "Sheffield Eagles ", "text": " Football League ground regulations and played the season in nearby Doncaster at the Keepmoat Stadium, home of Doncaster. In 2016 it was announced the Eagles would play at Sheffield Hallam University's Sports Park. The first league game played by the professional team there was against Halifax and they won 26–6. In 2017, the club agreed a one-year ground share with Wakefield Trinity at Belle Vue. The club also returned to being a semi-professional outfit after an unsuccessful time as professional. The Eagles made their long-awaited return to their home city at the Olympic Legacy Park in 2018. The new stadium"}, {"k": 2, "title": "2015–16 RFU Championship ", "text": " the second leg at home and therefore visited Bedford Blues and Yorkshire Carnegie respectively in the first legs on 1 May. The grounds of three of the teams met the minimum standards required to play in the Premiership next season. If Doncaster Knights are promoted they will initially play their matches at the Keepmoat Stadium, the home of Doncaster Rovers while Bristol will continue to play at Ashton Gate. Yorkshire Carnegie would have used their current home of Headingley Stadium if they had earned promotion. Bedford Blues did not apply to have their ground audited and, therefore, could not win"}, {"k": 3, "title": "Doncaster Mustangs ", "text": " Doncaster Mustangs The Doncaster Mustangs (who competed as the South Yorkshire Mustangs in 2008) are an American football team representing Doncaster, England. They currently play their home matches at the athletics stadium next to The Keepmoat Stadium, the home of Doncaster Rovers & Doncaster. They were established in the autumn of 2002 and now play in Midland Football Conference 1 (MFC1) of the BAFA Community Leagues. The Doncaster Mustangs Head Coach is current player Paul Weston who is assisted in the Offensive Coordinator position by QB Pete Rodgers. The Defensive side of the ball is coordinated by Coaches Chris Swinbourne"}]}, "In which US state is Green Bay?": {"answer_gt": "Wisconsin", "answer_pred": " Wisconsin", "query": "In which US state is Green Bay?", "docs": [{"k": 0, "title": "Green Bay, Wisconsin ", "text": " Green Bay, Wisconsin Green Bay is a city in and the county seat of Brown County in the U.S. state of Wisconsin, at the head of Green Bay, a sub-basin of Lake Michigan, at the mouth of the Fox River. It is above sea level and north of Milwaukee. The population was 104,057 at the 2010 census. Green Bay is the third-largest city in the state of Wisconsin, after Milwaukee and Madison, and the third-largest city on Lake Michigan's west shore, after Chicago and Milwaukee. Green Bay is home to the National Football League's Green Bay Packers. Green Bay is"}, {"k": 1, "title": "Green Bay, Wisconsin ", "text": " side. It is anchored by Ross Dress for Less, Party City, T.J. Maxx, HomeGoods, Big Lots, and Office Depot. It contains specialty shops and restaurants. Green Bay, Wisconsin Green Bay is a city in and the county seat of Brown County in the U.S. state of Wisconsin, at the head of Green Bay, a sub-basin of Lake Michigan, at the mouth of the Fox River. It is above sea level and north of Milwaukee. The population was 104,057 at the 2010 census. Green Bay is the third-largest city in the state of Wisconsin, after Milwaukee and Madison, and the third-largest"}, {"k": 2, "title": "Green Bay National Wildlife Refuge ", "text": " Green Bay National Wildlife Refuge Green Bay National Wildlife Refuge is a National Wildlife Refuge of the United States located in the state of Wisconsin. It includes three islands in Lake Michigan: Hog Island, Plum Island, and Pilot Island. The islands are near Washington Island off the tip of the Door Peninsula of Wisconsin. An executive order in 1913 declared Hog Island a national preserve for the benefit of native birds. Plum and Pilot Island were transferred from the U.S. Coast Guard to the U.S. Fish and Wildlife Service in 2007. The Green Bay National Wildlife Refuge became the second"}, {"k": 3, "title": "Green Bay National Wildlife Refuge ", "text": " Area. Green Bay National Wildlife Refuge Green Bay National Wildlife Refuge is a National Wildlife Refuge of the United States located in the state of Wisconsin. It includes three islands in Lake Michigan: Hog Island, Plum Island, and Pilot Island. The islands are near Washington Island off the tip of the Door Peninsula of Wisconsin. An executive order in 1913 declared Hog Island a national preserve for the benefit of native birds. Plum and Pilot Island were transferred from the U.S. Coast Guard to the U.S. Fish and Wildlife Service in 2007. The Green Bay National Wildlife Refuge became the"}]}, "What is the name of the perfume launched by British boyband JLS in January 2013?": {"answer_gt": "Love", "answer_pred": " Kiss", "query": "What is the name of the perfume launched by British boyband JLS in January 2013?", "docs": [{"k": 0, "title": "JLS ", "text": " together to create brand new fashion line, \"2KX\". Burke and JLS stated, \"We are eagerly waiting for the first stocks of the ultra-hyped menswear and womenswear range, due very soon.\" To coincide with the launch of their third album \"Jukebox\", they will feature in their very own edition of 'TheirMag', a newly formed sister publication to Rio Ferdinand's \"#5\" magazine. In March 2012, they launched their first fragrance, \"Kiss\", which sold 100,000 bottles on the first day. All four of the band members worked with perfume designer Azzi Glasser to form the scent. In February 2013, they launched their second"}, {"k": 1, "title": "Our Moment ", "text": " Our Moment Our Moment is the debut fragrance for women endorsed by English-Irish boy band One Direction. It was launched on 6 June 2013 in London. The line includes, besides the 30ml, 50ml and 100ml eau de parfum, a shower gel, a body lotion and a rollerball. The perfume is the best selling famous fragrance of Christmas 2013. Its sales have beaten fragrances from other celebrities such as Lady Gaga's \"Fame\", Nicki Minaj's \"Pink Friday\" and Britney Spears' \"Fantasy\". Our Moment is the first of the four fragrances to be promoted by One Direction, with That Moment, You & I"}, {"k": 2, "title": "Billion Lights ", "text": " Billion Lights \"Billion Lights\" is a song by British boy band JLS. The song is the only single (other than their 2012 charity single \"Proud\") from their greatest hits album, and fifth album overall, \"Goodbye – The Greatest Hits\" (2013). It was released on 17 November 2013, the day before the album, as JLS's second single before their split. On 15 December 2012, Marvin Humes revealed that JLS were to release their fifth album in 2013. \"By the time 2013 rolls round it'll be time for our fifth album,\" he said. \"This is usually a greatest hits in boy band"}, {"k": 3, "title": "Billion Lights ", "text": " to be a good one.\" The video was released on 4 October 2013. It features early clips from JLS' time on \"The X Factor\", old concert footage, awards ceremonies, their charity work and backstage footage. Billion Lights \"Billion Lights\" is a song by British boy band JLS. The song is the only single (other than their 2012 charity single \"Proud\") from their greatest hits album, and fifth album overall, \"Goodbye – The Greatest Hits\" (2013). It was released on 17 November 2013, the day before the album, as JLS's second single before their split. On 15 December 2012, Marvin Humes"}]}, "Who said sex is a bad thing it rumples the clothes?": {"answer_gt": "Jacqueline Kennedy Onassis", "answer_pred": " Sunny said", "query": "Who said sex is a bad thing it rumples the clothes?", "docs": [{"k": 0, "title": "Sex segregation in Iran ", "text": " the law, women’s clothing should meet the following conditions: Correspondingly, \"bad hijabi\" (improper veiling”) was considered a cultural crime. Bad hijabi is defined by the law as: “uncovered head, showing make-up, uncovered arms and legs, thin and see-through clothes, tight clothes such as trousers without an overall over them, clothes bearing foreign words, signs or pictures, nail varnish, brightly colored clothing and improper modes of body movement or talking”. The punishment of bad hijabi was 74 lashes in the 1983 Penal Law. In 1996, the Penal Law was reformed and the punishment of bad hijabi was reduced to prison (from"}, {"k": 1, "title": "Simon Lokodo ", "text": " at women. Clothes that are considered revealing or sexually provocative were to be outlawed; \"If you dress in such a way that you irritate the mind and excite the people then you are badly dressed; if you draw the attention of the other person outside there with a malicious purpose of exciting and stimulating him or her into sex,\" Lokodo stated. He is reported to speak and write fluent English, Italian, French, German, and Spanish. Simon Lokodo Simon Lokodo is a Ugandan politician who has served as Minister of State for Ethics & Integrity in the Office of the President"}, {"k": 2, "title": "Johnny Handsome ", "text": " just let women be bad... Sex is just one of the tools Sunny uses to get what she wants. And what she wants is money! Pure greed! Hill said I said to her, `Look, I don't know if you ought to do this thing. Because it's a good part. But you're at another kind of stage in your career and people might not think this is a real positive thing to do.' And she said, `Oh, (expletive). I'll never get a chance to play a villain this good. I want to do it.' And I was very happy. I wasn't"}, {"k": 3, "title": "Abercrombie Kids ", "text": " screenprinted on them. Parents mounted storefront protests in outrage of the sexually-suggestive underwear. CEO and Chairman of the Board Mike Jeffries said to an interviewer that he did not think the underwear to be \"bad\", but more \"cute.\" In mid-2011, Today Show featured a segment on padded triangle bikini tops being marketed towards 7- to 16-year-old girls. The bikini was criticized as being \"sexually ostentatious\" and \"promiscuous.\" In 2012, A&F announced plans that it would open its Abercrombie Kids shop at No. 3 on Savile Row, next door to Gieves & Hawkes. The building in question has cultural significance because"}]}, "Jonas Salk developed a vaccine against what?": {"answer_gt": "Polio", "answer_pred": " polio", "query": "Jonas Salk developed a vaccine against what?", "docs": [{"k": 0, "title": "Jonas Salk ", "text": " Jonas Salk Jonas Edward Salk (; October 28, 1914June 23, 1995) was an American medical researcher and virologist. He discovered and developed one of the first successful polio vaccines. Born in New York City, he attended New York University School of Medicine, later choosing to do medical research instead of becoming a practicing physician. In 1939, after earning his medical degree, Salk began an internship as a physician scientist at Mount Sinai Hospital. Two years later he was granted a fellowship at the University of Michigan, where he would study flu viruses with his mentor Thomas Francis, Jr. Until 1955,"}, {"k": 1, "title": "Jonas Salk ", "text": " laboratory. He later joined the National Foundation for Infantile Paralysis's polio project established by President Franklin D. Roosevelt. Extensive publicity and fear of polio led to much increased funding, $67 million by 1955, but research continued on dangerous live vaccines. Salk decided to use the safer 'killed' virus, instead of weakened forms of strains of polio viruses like the ones used contemporarily by Albert Sabin, who was developing an oral vaccine. After successful tests on laboratory animals, on July 2, 1952, assisted by the staff at the D.T. Watson Home for Crippled Children, Salk injected 43 children with his killed-virus"}, {"k": 2, "title": "The Immune Response Corporation ", "text": " Jonas Salk. Urbain created an anti-idiotype tumor vaccine against lymphocytes “not normally recognized” by the immune system. Urbain also conducted idiotypic research showing a “dramatic enhancement of an antiviral immune response by dendritic cells,” thus demonstrating the principle of a dendritic cell-enhanced immune response by means of anti-idiotype antibodies. The Immune Response Corporation filed a patent on this invention entitled: “Idiotypic Vaccination Against B-Cell Lymphoma” in May 1990. The IRC described the vaccination treatment under development as utilizing antigen-presenting dendritic cells to stimulate responses to tumor antigens. The dendritic cells are exposed to tumor antigens in vitro and then reintroduced"}, {"k": 3, "title": "SAV001 ", "text": " a feasible option for an HIV vaccine. Indeed, Jonas Salk developed a therapeutic HIV vaccine in 1987, called Remune now being developed by Immune Response BioPharma, Inc., is based on the killed whole virus approach. Remune vaccine has completed over 25 clinical studies to date and showed a robust mechanism of action restoring white blood cell counts in CD4 & CD8 T cells by reducing viral load and increasing immunity. Also, a group of researchers and professionals in the field of HIV strongly advocates that the killed HIV approach must be taken to fight back the global HIV and AIDS"}]}, "The site of Carthage is now in a suburb of which modem capital city?": {"answer_gt": "Tunis", "answer_pred": " Tunis", "query": "The site of Carthage is now in a suburb of which modem capital city?", "docs": [{"k": 0, "title": "Carthage ", "text": " and began serving the \"lycée\" level. It is currently the Lycée Gustave Flaubert. After Tunisian independence in 1956, the Tunis conurbation gradually extended around the airport, and Carthage (قرطاج \" Qarṭāj\") is now a suburb of Tunis, covering the area between Sidi Bou Said and Le Kram. Its population as of January 2013 was estimated at 21,276, mostly attracting the more wealthy residents. If Carthage is not the capital, it tends to be the political pole, a « place of emblematic power » according to Sophie Bessis, leaving to Tunis the economic and administrative roles. The Carthage Palace (the Tunisian"}, {"k": 1, "title": "Carthage ", "text": " presidential palace) is located in the coast. The suburb has six train stations of the TGM line between Le Kram and Sidi Bou Said: Carthage Salammbo (named for Salambo, the fictional daughter of Hamilcar), Carthage Byrsa (named for Byrsa hill), Carthage Dermech (\"Dermèche\"), Carthage Hannibal (named for Hannibal), Carthage Présidence (named for the Presidential Palace) and Carthage Amilcar (named for Hamilcar). The merchants of Carthage were in part heirs of the Mediterranean trade developed by Phoenicia, and so also heirs of the rivalry with Greek merchants. Business activity was accordingly both stimulated and challenged. Cyprus had been an early site"}, {"k": 2, "title": "Carthage (municipality) ", "text": " for Tunisair. In the 1950s the Lycée Français de Carthage was established to serve French families in Carthage. In 1961 it was given to the Tunisian government as part of the Independence of Tunisia, so the nearby Collège Maurice Cailloux in La Marsa, previously an annex of the Lycée Français de Carthage, was renamed to the Lycée Français de La Marsa and began serving the \"lycée\" level. It is currently the Lycée Gustave Flaubert. After Tunisian independence in 1956, the Tunis conurbation gradually extended around the airport, and Carthage is now a suburb of Tunis. In February 1985, Ugo Vetere,"}, {"k": 3, "title": "History of Carthage ", "text": " has spread to include the ancient site of Carthage in a modern suburb. Carthage was one of a number of Phoenician settlements in the western Mediterranean that were created to facilitate trade from the cities of Sidon, Tyre and others from Phoenicia, which was situated in the coast of what is now Lebanon. In the 10th century BC, the eastern Mediterranean shore was inhabited by various Semitic populations, who had built up flourishing civilizations. The people inhabiting what is now Lebanon were referred to as \"Phoenicians\" by the Greeks. The Phoenician language was very close to ancient Hebrew, to such"}]}, "Which is the largest island in Canada?": {"answer_gt": "Baffin Island", "answer_pred": " Baffin Island", "query": "Which is the largest island in Canada?", "docs": [{"k": 0, "title": "Baffin Island ", "text": " Baffin Island Baffin Island ( , ), in the Canadian territory of Nunavut, is the largest island in Canada and the fifth-largest island in the world. Its area is and its population is about 11,000 (2007 estimate). It is located 65.4215 N and 70.9654 W. Named after English explorer William Baffin, it is likely that the island was known to Pre-Columbian Norse explorers from Greenland and Iceland and that it was the location of \"Helluland\", spoken of in the Icelandic sagas (the Grœnlendinga saga and the Saga of Erik the Red, Eiríks saga rauða). Iqaluit, the capital of Nunavut, is"}, {"k": 1, "title": "Queen Elizabeth Islands ", "text": " of the Canadian Arctic Archipelago. Many of the islands are among the largest in the world, the largest being Ellesmere Island. Other major islands include Amund Ringnes Island, Axel Heiberg Island, Bathurst Island, Borden Island, Cornwall Island, Cornwallis Island, Devon Island, Eglinton Island, Ellef Ringnes Island, Mackenzie King Island, Melville Island, and Prince Patrick Island. Other smaller but notable islands include; Beechey Island (), which held the graves of Petty Officer John Torrington, Royal Marine Private William Braine, and Able Seaman John Hartnell, three members of Sir John Franklin's crew, Hans Island (), a small, uninhabited barren knoll measuring whose"}, {"k": 2, "title": "Akimiski Island ", "text": " Akimiski Island Akimiski Island is the largest island in James Bay (a southeasterly extension of Hudson Bay), Canada, which is part of the Qikiqtaaluk Region of the territory of Nunavut. It has an area of , making it the 163rd largest island in the world, and Canada's 29th largest island. Akimiski Island is only from the province of Ontario. From the western side of the island, one can see the Ontario coastline. The island's name is Cree for \"land across the water\". The island has no year-round human inhabitants; however, it is part of the Attawapiskat First Nation's traditional territory"}, {"k": 3, "title": "Victoria Island (Canada) ", "text": " Victoria Island (Canada) Victoria Island (or Kitlineq) is a large island in the Canadian Arctic Archipelago that straddles the boundary between Nunavut and the Northwest Territories of Canada. It is the eighth largest island in the world, and at in area, it is Canada's second largest island. It is nearly double the size of Newfoundland (), and is slightly larger than the island of Great Britain () but smaller than Honshu (). It contains the world's largest island within an island within an island. The western third of the island belongs to the Inuvik Region in the Northwest Territories; the"}]}, "Which organization of the Catholic church whose name is Latin for 'Work of God' received world attention with the publication of The Da Vinci Code in which it is portrayed as participating in a sinister international conspiracy?": {"answer_gt": "Opus Dei", "answer_pred": " Opus Dei", "query": "Which organization of the Catholic church whose name is Latin for 'Work of God' received world attention with the publication of The Da Vinci Code in which it is portrayed as participating in a sinister international conspiracy?", "docs": [{"k": 0, "title": "The Da Vinci Code (film) ", "text": " of calumnies, offences, and historical and theological errors\". Cardinal Francis Arinze, in a documentary called \"The Da Vinci Code: A Masterful Deception\", urged unspecified legal action against the makers of the film. He was formerly Prefect of the Congregation for Divine Worship and the Discipline of the Sacraments in the Vatican. Stating that it does not intend to organize any boycotts, Opus Dei (the Catholic organization that is featured prominently in the novel and the film) released a statement on February 14, 2006, asking Sony Pictures to consider editing the soon-to-be-released film so that it would not contain references that"}, {"k": 1, "title": "Opus Dei ", "text": " Zorzano Ledesma, an Argentinian engineer; Dora del Hoyo, a domestic worker; and Father José Luis Múzquiz de Miguel. During the pontificate of John Paul II, two members of Opus Dei, Juan Luis Cipriani Thorne and Julián Herranz Casado, were made cardinals. In September 2005, Pope Benedict XVI blessed a newly installed statue of Josemaría Escrivá placed in an outside wall niche of St Peter's Basilica, a place for founders of Catholic organizations. During that same year, Opus Dei received some unwanted attention due to the extraordinary success of the novel \"The Da Vinci Code\", in which both Opus Dei and"}, {"k": 2, "title": "Opus Dei ", "text": " Opus Dei Opus Dei, formally known as The Prelature of the Holy Cross and Opus Dei (), is an institution of the Roman Catholic Church which teaches that everyone is called to holiness and that ordinary life is a path to sanctity. The majority of its membership are lay people; the remainder are secular priests under the governance of a prelate elected by specific members and appointed by the Pope. \"Opus Dei\" is Latin for \"Work of God\"; hence the organization is often referred to by members and supporters as \"the Work\". Opus Dei was founded in Spain in 1928"}, {"k": 3, "title": "Opus Dei ", "text": " Escrivá, on that day he experienced a vision in which he \"saw Opus Dei\". He gave the organization the name \"Opus Dei\", which in Latin means \"Work of God\", in order to underscore the belief that the organization was not his (Escrivá's) work, but was rather God's work. Throughout his life, Escrivá held that the founding of Opus Dei had a supernatural character. Escrivá summarized Opus Dei's mission as a way of helping ordinary Christians \"to understand that their life... is a way of holiness and evangelization... And to those who grasp this ideal of holiness, the Work offers the"}]}, "Who is said to have cut the Gordian Knot?": {"answer_gt": "Alexander the Great", "answer_pred": " Alexander", "query": "Who is said to have cut the Gordian Knot?", "docs": [{"k": 0, "title": "Gordian Knot ", "text": " that, according to Aristobulus, Alexander pulled the knot out of its pole pin, exposing the two ends of the cord and allowing him to untie the knot without having to cut through it. Some classical scholars regard this as more plausible than the popular account. Literary sources of the story include Alexander's propagandist Arrian (\"Anabasis Alexandri \"2.3), Quintus Curtius (3.1.14), Justin's epitome of Pompeius Trogus (11.7.3), and Aelian's \"De Natura Animalium\" 13.1. Alexander later went on to conquer Asia as far as the Indus and the Oxus, thus fulfilling the prophecy. The knot may have been a religious knot-cipher guarded"}, {"k": 1, "title": "Gordian Knot ", "text": " Gordian Knot The Gordian Knot is a legend of Phrygian Gordium associated with Alexander the Great. It is often used as a metaphor for an intractable problem (disentangling an \"impossible\" knot) solved easily by finding a loophole or thinking creatively (\"cutting the Gordian knot\"): The Phrygians were without a king, but an oracle at Telmissus (the ancient capital of Lycia) decreed that the next man to enter the city driving an ox-cart should become their king. A peasant farmer named Gordias drove into town on an ox-cart and was immediately declared king. Out of gratitude, his son Midas dedicated the"}, {"k": 2, "title": "Gordium ", "text": " range wide enough to accommodate both proposed archaeological dates. Although the date of the destruction continues to be debated, a date of c. 800 BCE is now most-commonly accepted. According to ancient tradition, in 333 BCE Alexander the Great cut (or otherwise unfastened) the Gordian Knot: this intricate knot joined the yoke to the pole of a Phrygian wagon that stood on the acropolis of the city. The wagon was associated with Midas or Gordias (or both), and was connected with the dynasty's rise to power. A local prophecy had decreed that whoever could loosen the knot was destined to"}, {"k": 3, "title": "Gordian Knot ", "text": " any man who could unravel its elaborate knots was destined to become ruler of all of Asia. Alexander wanted to untie the knot but struggled to do so without success. He then reasoned that it would make no difference \"how\" the knot was loosed, so he drew his sword and sliced it in half with a single stroke. In an alternative version of the story, Alexander loosed the knot by pulling the linchpin from the yoke. Sources from antiquity agree that Alexander was confronted with the challenge of the knot, but his solution is disputed. Both Plutarch and Arrian relate"}]}, "Who in verse sailed to the land where the bong tree grows": {"answer_gt": "The owl and the pussycat", "answer_pred": " Emain", "query": "Who in verse sailed to the land where the bong tree grows", "docs": [{"k": 0, "title": "The Tale of Little Pig Robinson ", "text": " market was in truth the ship's cook who had planned to turn Little Pig Robinson into a fine feast for the ship's men. With the help of the ship's resident cat, Little Pig Robinson escapes on a rowboat and finds his way to \"the land where the Bong tree grows\". Some time later Pig Robinson meets the Owl and the Pussycat there. Potter began writing \"The Tale of Little Pig Robinson\" in 1893 after a holiday to Falmouth and other coastal towns where she gained inspiration from the landscape. \"Pig Robinson\" was written as a prequel to Edward Lear's poem"}, {"k": 1, "title": "James Ramsey Ullman ", "text": " the Bong Tree Grows,\" an account of a year he spent travelling through some of the most remote islands of the South Pacific. Ullman also wrote a novel about the poet Arthur Rimbaud, \"The Day on Fire\" (1958). He joined the American Mount Everest Expedition 1963 as an official historian. Because of health problems he had to stay in Kathmandu. His book \"Americans on Everest: The Official Account of the Ascent\" was published in 1964. The authour, James Ramsey Ullman, died in Boston from cancer on July 5, 1971. His papers, which include an archive regarding Temple Fielding, are at"}, {"k": 2, "title": "The Owl and the Pussycat ", "text": " characters who marry in the land \"where the Bong-tree grows\". The Owl and the Pussycat set out to sea in a pea green boat with honey and \"plenty of money\" wrapped in a five-pound note. The Owl serenades the Pussycat while gazing at the stars and strumming on a small guitar. The Owl describes the Pussycat as beautiful. The Pussycat responds by describing the Owl as an \"elegant fowl\" and compliments the bird's singing. The Pussycat urges that they marry; however, they do not have a ring. They sail away for a year and a day to a land where"}, {"k": 3, "title": "The Voyage of Bran ", "text": " his company is there, an Otherworld woman appears, and sings to him a poem about the land where the branch had grown. In the song, she identifies the branch to be from an apple tree in Emain, another part of Ireland. In this Otherworld, it is always summer, there is no want of food or water, no sickness or despair ever touches the perfect people, and there is no unhappiness or \"no rough or harsh voice.\" She tells Bran to voyage to the Land of Women across the sea, and the next day he gathers a company of nine men"}]}, "On which river is Kings Lynn": {"answer_gt": "The Great Ouse", "answer_pred": " Great Ouse", "query": "On which river is Kings Lynn", "docs": [{"k": 0, "title": "King's Lynn ", "text": " north-west margin of East Anglia. King's Lynn has an area of . The Great Ouse at Lynn is about wide and is the outfall for much of the drainage system of the Fens. The much smaller Gaywood River also flows through the town, joining the Great Ouse at the southern end of South Quay close to the town centre. A small part, known as West Lynn, is on the west bank, and linked to the town centre by one of the oldest ferries in the country. Other districts of King's Lynn include the town centre, North Lynn, South Lynn, and"}, {"k": 1, "title": "Gaywood River ", "text": " Gaywood River Gaywood River (sometimes known as the River Gay or River Gaywood or, in King's Lynn, as the Fisher Fleet) is a tributary of the River Great Ouse in the west of the county of Norfolk. Its source is 11 metres above sea level, northwest of the village of Gayton in Derby Fen, Map Reference TF 705 209. It runs for to its outflow into the River Great Ouse in the town of King's Lynn. Derby Fen is the remnant of a valley fen system once found in these parts. The remnant supports a range of habitats from dry"}, {"k": 2, "title": "King's Lynn Docks ", "text": " King's Lynn Docks King's Lynn Docks are located to the north of the town of King's Lynn in the English county of Norfolk. They are on the River Great Ouse which provides access to the North Sea via the Lynn Channel and The Wash. They are located north of Cambridge, west of Norwich and north of London on the A1078 Edward Benefer Way. The docks are operated as the Port of King's Lynn by Associated British Ports. It handles around 750,000 tonnes of cargo a year, including agricultural and forest products, chemicals, steel and other metals. Three docks, including the"}, {"k": 3, "title": "Gaywood River ", "text": " Bawsey the river passes under a disused railway track bed and crosses the countryside westwards and skirts to the north of the ruins of St. Mary's church which stands on the small hill to the south of the river. Then the river passes under the A149, King's Lynn to Hunstanton road. Now in the lower reaches and entering the outskirts of King's Lynn the river banks have been the subject of much flood defence work. Skirting the southern side of South Wootton the river passes under the A148 and turns southwards alongside a residential street called Riverside for a short"}]}, "Which 1969 film, based on a stage musical, marked the directorial debut of Richard Attenborough?": {"answer_gt": "OH! WHAT A LOVELY WAR", "answer_pred": " 1969", "query": "Which 1969 film, based on a stage musical, marked the directorial debut of Richard Attenborough?", "docs": [{"k": 0, "title": "Oh! What a Lovely War ", "text": " Oh! What a Lovely War Oh! What a Lovely War is a 1969 British comedy musical film directed by Richard Attenborough (in his directorial debut), with an ensemble cast including Maggie Smith, Dirk Bogarde, John Gielgud, John Mills, Kenneth More, Laurence Olivier, Jack Hawkins, Corin Redgrave, Michael Redgrave, Vanessa Redgrave, Ralph Richardson, Ian Holm, Paul Shelley, Malcolm McFee, Jean-Pierre Cassel, Nanette Newman, Edward Fox, Susannah York, John Clements, Phyllis Calvert and Maurice Roëves. The film is based on the stage musical \"Oh, What a Lovely War!\", originated by Charles Chilton as a radio play, \"The Long Long Trail\" in December"}, {"k": 1, "title": "Richard Attenborough ", "text": " a Lovely War\" (1969), after which his acting appearances became sporadic as he concentrated more on directing and producing. He later directed two epic period films: \"Young Winston\" (1972), based on the early life of Winston Churchill, and \"A Bridge Too Far\" (1977), an all-star account of Operation \"Market Garden\" in World War II. He won the 1982 Academy Award for Best Director for his historical epic \"Gandhi\", and as the film's producer, the Academy Award for Best Picture; the same film garnered two Golden Globes, this time for Best Director and Best Foreign Film, in 1983. He had been"}, {"k": 2, "title": "Oh, What a Lovely War! ", "text": " the CD41 album series \"Oh! It's A Lovely War\" (four volumes). Richard Attenborough's sweeping and elaborate film adaptation was released in 1969, also as a musical, and garnered numerous awards. It was Attenborough's debut as a director, and one of Maggie Smith's earliest film appearances. Several Australian World War I movies and miniseries (e.g. \"The Lighthorsemen\" and \"Gallipoli\") have used these songs to give a stronger sense of period to them. The 1985 series \"Anzacs\" used \"Oh, it's a lovely war\" as one of the numbers while the credits rolled, had \"I wore a tunic\" performed as part of an"}, {"k": 3, "title": "Richard Attenborough ", "text": " attempting to get the project made for 18 years. He directed the screen version of the musical \"A Chorus Line\" (1985) and the anti-apartheid drama \"Cry Freedom\" (1987). He was nominated for a Golden Globe Award for Best Director for both films. His later films as director and producer include \"Chaplin\" (1992) starring Robert Downey Jr., as Charlie Chaplin and \"Shadowlands\" (1993), based on the relationship between C. S. Lewis and Joy Gresham (the star of the latter was Anthony Hopkins, who had appeared in four previous films for Attenborough: \"Young Winston\", \"A Bridge Too Far\", \"Magic\" and \"Chaplin\"). Between"}]}, "Stylised as a lower case x, the album ‘Multiply’, which topped the UK charts for 8 weeks in 2014, is by which Brit award-winning singer-songwriter?": {"answer_gt": "Ed Sheeran", "answer_pred": " Ed Sheeran", "query": "Stylised as a lower case x, the album ‘Multiply’, which topped the UK charts for 8 weeks in 2014, is by which Brit award-winning singer-songwriter?", "docs": [{"k": 0, "title": "Rockbird ", "text": " the album artwork with the lettering in either green, orange, pink and yellow (with slight variations due to printing techniques). The album peaked at #31 in the UK, and remained in the charts for 11 weeks. Although one of her lowest charting solo albums in the UK to date, it was actually the highest selling and was certified \"Gold\" by the BPI in January 1987 for sales in excess of 100,000 copies. Due to lack of record company promotion, the album was far less successful in the US, peaking at #97 on Billboard's album charts. A stylised version of the"}, {"k": 1, "title": "Sticky Studios ", "text": " tracks on Sheeran's second album x (2014). x spent 8 weeks at number 1 in the UK, in its first week it charted at number 1 in 12 countries and has been certified 7x Platinum, as well as being named the UK's biggest selling album of 2014. One Direction came down to the studio in 2011 to work with studio owner, Jake Gosling, to produce the track Moments from One Direction multi-platinum selling debut album \"Up All Night\". The album was an international success, topping the charts in 16 countries. The album debuted at number 2 on the UK album"}, {"k": 2, "title": "X (Ed Sheeran album) ", "text": " the UK, the longest number one since Adele's \"21\" in 2011. \"x\" was the best-selling album of 2014 in the UK, selling over 1,689,000 copies and going five-time platinum. As of December 2015, the album has sold 2,660,000 copies in the UK. The album spent 74 consecutive weeks in the top ten, surpassing \"21\" 71-week record. In the United States, the album became Sheeran's first number one on the \"Billboard\" 200, debuting at number one with sales of 210,000 copies. Furthermore, Sheeran marked the second largest debut for a pop album in 2014 and the fourth-biggest opening overall of the"}, {"k": 3, "title": "X (Ed Sheeran album) ", "text": " tweeted \"My next single from multiply is Photograph. Wait til you see the video, it's a special one. Very excited\". Photograph then hit No.2 on Twitter Top Track Charts and also in Billboard Hot 100. The song first charted for a week in December 2014. Even before the announcement of an official release, \"Photograph\" was certified Silver in the UK for selling in excess of 200,000 copies. The music video for the single was released on 10 May 2015. \"One\" was entered in the UK Singles Chart at No. 20 and entered the \"Billboard\" Hot 100 at No. 86. \"Don't\""}]}, "\"What beer is advertised by \"\"The World's Most Interesting Man\"\"?\"": {"answer_gt": "Dos Equis", "answer_pred": " Dos Equis", "query": "\"What beer is advertised by \"\"The World's Most Interesting Man\"\"?\"", "docs": [{"k": 0, "title": "The Most Interesting Man in the World ", "text": " The Most Interesting Man in the World The Most Interesting Man in the World was an advertising campaign for Dos Equis beer. The ads featured a bearded, debonair gentleman with voiceovers that were both humorous and outrageous and the slogan \"Stay Thirsty My Friends\". The advertisements first began appearing in the United States in 2006 and became a popular Internet meme. The campaign was ended in 2018. The advertisements first began appearing in the United States in 2006, with The Most Interesting Man in the World portrayed by American actor Jonathan Goldsmith, and \"Frontline\" narrator Will Lyman providing voiceovers. They"}, {"k": 1, "title": "The Most Interesting Man in the World ", "text": " host Joseph Gordon-Levitt played the unimpressive son of The Most Interesting Man in the World in a pair of sketches, with Jason Sudeikis appearing as his father in the second. The Most Interesting Man in the World The Most Interesting Man in the World was an advertising campaign for Dos Equis beer. The ads featured a bearded, debonair gentleman with voiceovers that were both humorous and outrageous and the slogan \"Stay Thirsty My Friends\". The advertisements first began appearing in the United States in 2006 and became a popular Internet meme. The campaign was ended in 2018. The advertisements first"}, {"k": 2, "title": "The Most Interesting Man in the World ", "text": " There are secondary advertisements that are similar to the final part of the original advertisements. They feature the man sitting in a social setting, surrounded by beautiful young women, conveying a short opinion to the viewer on certain subjects, such as bar nuts, the two-party system, self-defense, trophy wives, and \"bromance\". He then finishes the advertisement by holding a Dos Equis beer and saying, \"Stay thirsty, my friends.\" The advertisements featuring Legrand end with a slightly different sign-off: \"Stay thirsty, \"mis amigos\"\" (Spanish for \"my friends\"). The agency's rationale for the brand strategy was defined as: \"He is a man"}, {"k": 3, "title": "The Most Interesting Man in the World ", "text": " know how it felt, and finding the Fountain of Youth but not drinking from it, \"because he wasn't thirsty\". Other feats are more centered on his physical abilities and personality. These include his small talk changing foreign policies, parallel-parking a train, and slamming a revolving door. At the end of the advertisement, the most interesting man, usually shown sitting in a night club or other social setting surrounded by several beautiful young women, says, \"I don't always drink beer. But when I do, I prefer Dos Equis.\" Each commercial ends with him stating the signature sign-off: \"Stay thirsty, my friends.\""}]}, "Which tennis player, born in 1946, was nicknamed ‘Nasty’?": {"answer_gt": "Ilie Nastase", "answer_pred": " Ilie Năstase", "query": "Which tennis player, born in 1946, was nicknamed ‘Nasty’?", "docs": [{"k": 0, "title": "Ilie Năstase ", "text": " Ilie Năstase Ilie \"Nasty\" Năstase (, born 19 July 1946) is a Romanian former world No. 1 professional tennis player, and one of the world's top players of the 1970s. He was ranked world No. 1 from 23 August 1973 to 2 June 1974. Năstase is one of the ten players in history who have won more than 100 ATP professional titles (58 singles and 45 in doubles). He was inducted into the International Tennis Hall of Fame in 1991. Năstase won seven Grand Slam titles: two in singles, three in men's doubles and two in mixed doubles. He also"}, {"k": 1, "title": "Ilie Năstase ", "text": " in February 2010, after six years of marriage. As he played for the Army's sports club Steaua, he was an employee of the Ministry of Defence.. He was granted the rank of retired Major General. On 25 May 2018, Năstase was arrested twice within a six-hour span in one day for drunk driving and riding a scooter through a red light. \"Qualifying matches and Walkovers are neither official match wins nor losses.\" Ilie Năstase Ilie \"Nasty\" Năstase (, born 19 July 1946) is a Romanian former world No. 1 professional tennis player, and one of the world's top players of"}, {"k": 2, "title": "Jon Mirasty ", "text": " Jon Mirasty Jonathon Gary Frank Mirasty (born June 4, 1982, Meadow Lake, Saskatchewan) is a retired Cree native Canadian ice hockey player who played in multiple professional leagues including the WHL, KHL, and AHL. Nicknamed \"Nasty\" by both teammates and fans, Mirasty developed a cult following throughout his career due to his Mohawk hairstyle and his laughing during his fights. Mirasty finished the 2010-11 regular season with the Fort Wayne Komets. However, he was left off the playoff roster. Mirasty, who weighs 220 pounds despite standing just five-foot-ten, had originally planned on discontinuing to play hockey in 2006. After playing"}, {"k": 3, "title": "Tom Mastny ", "text": " Tom Mastny Thomas Raymond Mastny (born February 4, 1981) is a former Major League Baseball right-handed relief pitcher. He stands 6 feet, 6 inches in height and weighs 220 pounds. Mastny is the only Indonesian-born player in Major League history, although he was raised in Zionsville, Indiana, where he played for Zionsville Community High School. He made his major league debut with the Indians on July 25, . Mastny, nicknamed \"Mr. Nasty\", was born in Bontang, Indonesia, and played collegiate baseball at Furman University, where he was primarily used as a starting pitcher. In , he was named the Southern"}]}, "What commonly used English Latin expression means literally 'so' or 'thus' or 'in this manner', and generally refers to a quoted error?": {"answer_gt": "Sic", "answer_pred": " sic", "query": "What commonly used English Latin expression means literally 'so' or 'thus' or 'in this manner', and generally refers to a quoted error?", "docs": [{"k": 0, "title": "Et cetera ", "text": " Et cetera Et cetera (in English; ; ), abbreviated to etc., etc, &c., or &c, is a Latin expression that is used in English to mean \"and other similar things\", or \"and so forth\". Translated literally from Latin, means 'and', while means 'the rest'; thus the expression means 'and the rest (of such things)'. It is a calque of the Koine Greek , 'and the other things'. (The more usual Greek form was , 'and the remainder'.) The one-word spelling \"etcetera\" appears in some dictionaries. The abbreviated form \"&c.\" or \"&c\" is still occasionally used. (The ampersand character, \"&\", derives"}, {"k": 1, "title": "Sic ", "text": " Sic The Latin adverb sic (\"thus\", \"just as\"; in full: , \"thus was it written\") inserted after a quoted word or passage indicates that the quoted matter has been transcribed or translated exactly as found in the source text, complete with any erroneous, archaic, or otherwise nonstandard spelling. It also applies to any surprising assertion, faulty reasoning, or other matter that might be likely interpreted as an error of transcription. The usual usage is to inform the reader that any errors or apparent errors in quoted material do not arise from errors in the course of the transcription, but are"}, {"k": 2, "title": "Sic ", "text": " \"sic\", a comma or colon, \"read\", and the correct reading, all within square brackets, as in the following example: Sic The Latin adverb sic (\"thus\", \"just as\"; in full: , \"thus was it written\") inserted after a quoted word or passage indicates that the quoted matter has been transcribed or translated exactly as found in the source text, complete with any erroneous, archaic, or otherwise nonstandard spelling. It also applies to any surprising assertion, faulty reasoning, or other matter that might be likely interpreted as an error of transcription. The usual usage is to inform the reader that any errors"}, {"k": 3, "title": "Scientific terminology ", "text": " informal or non-technical English, to say \"strictly speaking\" for \"sensu stricto\" and \"broadly speaking\" and so on is valid. Even in formal writing, there is no formal requirement to use the Latin terms rather than the vernacular. Valid reasons for using these Latin or partly Latin expressions are not points of pretentiousness; they include: A good example is the word \"laser\", an acronym for \"Light Amplification by Stimulated Emission of Radiation\", and therefore all its letters should be capitalized. However, because of frequent use, this acronym became a neologism, i.e., it has integrated into English and most other languages. Consequently,"}]}, "What is the name for a person who tried to turn base metals into gold?": {"answer_gt": "Alchemist", "answer_pred": " Alchemist", "query": "What is the name for a person who tried to turn base metals into gold?", "docs": [{"k": 0, "title": "Johann Friedrich Böttger ", "text": " for gold) learned of this, he requested that Böttger be taken into protective custody. Böttger escaped, but was detained and taken back to Dresden. The monarch of Saxony Augustus II of Poland (aka. Augustus II the Strong - well known for his insatiable hankering for gold), but who was always short of money, demanded that Böttger produce the so-called \"Goldmachertinktur\" in order to convert base metals into gold. Imprisoned in a dungeon, Böttger toiled away many a year, at many a noxious concoction, attempting to produce the 'gold making tincture' and, therefore, to regain his freedom. In 1704, impatient with"}, {"k": 1, "title": "Gold (1934 film) ", "text": " Gold (1934 film) Gold is a 1934 German science fiction film directed by Karl Hartl. The film involves a British scientist who is attempting to create a device that turns base materials into gold. He later forces the German scientist's assistant Werner Holk (Hans Albers), who was working on a similar experiment, to come to his underwater nuclear reactor to help him. \"Gold\" was made in both German-language and French-language versions with Brigitte Helm reprising her role in both. A German scientist has discovered a theoretical means of transforming lead into gold. Working with his engineer Werner Holk (Hans Albers),"}, {"k": 2, "title": "Philosopher's stone ", "text": " contains a story about the philosopher's stone. A great Hindu sage wrote about the spiritual accomplishment of Gnosis using the metaphor of the philosopher's stone. Saint Jnaneshwar (1275–1296) wrote a commentary with 17 references to the philosopher's stone that explicitly transmutes base metal into gold. The seventh century Siddhar Thirumoolar in his classic \"Tirumandhiram\" explains man's path to immortal divinity. In verse 2709 he declares that the name of God, Shiva is an alchemical vehicle that turns the body into immortal gold. The most commonly mentioned properties are the ability to transmute base metals into gold or silver, and the"}, {"k": 3, "title": "Robert Paston, 1st Earl of Yarmouth ", "text": " was accepted as an Original Fellow on 20 May 1663. With another Fellow, Thomas Henshaw, he attempted to discover a formula for the fabled \"red elixir\", another name for the philosopher's stone which alchemists believed could transmute base metals into gold. In a letter to Sir Thomas Browne he informed the Norwich physician-philosopher of his alchemical experiments - Paston lived at Richmond. In May 1666, he wrote a letter to his wife mentioning \"a game of criquett (\"sic\") on Richmond Green\" which is the first reference to cricket at Richmond Green, a popular venue for important matches during the 17th"}]}, "Which US State ended prohibition in November 1948, a law that had been in place there for 68 years?": {"answer_gt": "Kansas", "answer_pred": " Kansas", "query": "Which US State ended prohibition in November 1948, a law that had been in place there for 68 years?", "docs": [{"k": 0, "title": "Prohibition in Canada ", "text": " prohibition in 1924, along with Saskatchewan, upon realizing that the laws were unenforceable. Prince Edward Island was the last province to repeal prohibition in 1948. Despite the lifting of Prohibition, it still remained illegal for most types of liquor to be shipped across provincial borders, under the Importation of Intoxicating Liquors Act, into the 21st century. In response, Okanagan MP Dan Albas tabled Bill C-311, which would repeal this restriction and allow the interprovincial distribution of wine (but not beer or spirits). With the promise of potential for increased investment in Canada's wine industry if the restrictions were lifted (owing"}, {"k": 1, "title": "Gag Law (Puerto Rico) ", "text": " political status for the island. The bill was signed into law on June 10, 1948 by Jesús T. Piñero, the United States-appointed governor. Opponents tried but failed to have the law declared unconstitutional by the United States Supreme Court. The law remained in force for nine years until 1957, when it was repealed on the basis that it was unconstitutional as protected by freedom of speech within of the Constitution of Puerto Rico and the First Amendment of the Constitution of the United States. After the United States invaded Puerto Rico in 1898 during the Spanish–American War, some leaders, such"}, {"k": 2, "title": "Iroquois ", "text": " submitted were filed at the approach of the 5-year deadline in August, 1951. On 2 July 1948 Congress enacted [Public Law 881] 62 Stat. 1224, which transferred criminal jurisdiction over offenses committed by and against \"Indians\" to the State of New York. It covered all reservations lands within the state and prohibited the deprivation of hunting and fishing rights which may have been guaranteed to \"any Indian tribe, band, or community, or members thereof.\" It further prohibited the state from requiring tribal members to obtain fish and game licenses. Within 2 years, Congress passed [Public Law 785] 64 Stat. 845,"}, {"k": 3, "title": "Alcohol laws of Kansas ", "text": " the end of nationwide prohibition, a proposal was put to referendum that Kansas end its statewide prohibition, and regulate and tax liquor instead. Voters rejected it by a sizable margin. The prohibition amendment allowed the Kansas Legislature to define what constituted \"intoxicating liquor.\" So in 1937, the legislature passed a law defining beer with an alcohol content of 3.2% or less by weight as cereal malt beverage, or \"CMB,\" thereby excluding CMB from the definition of \"intoxicating liquor.\" The new law also authorized sale of CMB for both on- and off-premises consumption throughout the state. In 1948, voters approved an"}]}, "In humans, microcephaly is having an abnormally small what?": {"answer_gt": "Head", "answer_pred": " head", "query": "In humans, microcephaly is having an abnormally small what?", "docs": [{"k": 0, "title": "Microcephaly ", "text": " Microcephaly Microcephaly is a medical condition in which the brain does not develop properly resulting in a smaller than normal head. Microcephaly may be present at birth or it may develop in the first few years of life. Often people with the disorder have an intellectual disability, poor motor function, poor speech, abnormal facial features, seizures, and dwarfism. The disorder may stem from a wide variety of conditions that cause abnormal growth of the brain, or from syndromes associated with chromosomal abnormalities. A homozygous mutation in one of the \"microcephalin\" genes causes primary microcephaly. It serves as an important neurological"}, {"k": 1, "title": "Birth defect ", "text": " in fetuses. Microcephaly is a disorder in which the fetus has an atypically small head, cerebral calcifications means certain areas of the brain have atypical calcium deposits, and meningoencephalitis is the enlargement of the brain. All three disorders cause abnormal brain function or mental retardation. Hepatosplenomegaly is the enlargement of the liver and spleen which causes digestive problems. It can also cause some kernicterus and petechiae. Kernicterus causes yellow pigmentation of the skin, brain damage, and deafness. Petechaie is when the capillaries bleed resulting in red/purple spots on the skin. However, cytomegalovirus is often fatal in the embryo. The herpes"}, {"k": 2, "title": "VPS13B ", "text": " similar to the Ewing sarcoma but this one is the only one that has the VPS13B gene. Microcephaly is a medical condition which the head is misshaped and is smaller than the normal size head shape. The reason it occurs is that will the fetus was in the womb its head stopped forming or the brain stop forming. It effects the head and brain shaped. Even when this occurs the person will be normal, and it does not affect them, but this is on occasion. Most of the time when this happens, they have problems with seizures, development delays, problems"}, {"k": 3, "title": "Microcephaly ", "text": " pregnant women's \"in utero\" children received a biologically significant radiation dose that was relatively high due to the massive neutron output of the lower explosive-yielding Little Boy. Microcephaly is the only proven malformation, or congenital abnormality, found in the children of Hiroshima and Nagasaki. Intracranial volume also affects this pathology, as it is related with the size of the brain. Microcephaly generally is due to the diminished size of the largest part of the human brain, the cerebral cortex, and the condition can arise during embryonic and fetal development due to insufficient neural stem cell proliferation, impaired or premature neurogenesis,"}]}}, "model_q_mode": "no_rewrite", "model_a_mode": "answer", "model_r_mode": "RM", "wiki_only": "False", "entire_doc": "False", "k": 4}