{"dataset_name": "triviaQA", "data": {"Miami Beach in Florida borders which ocean?": {"answer_gt": "Atlantic", "answer_pred": " Atlantic Ocean", "query": "\n\n\"Miami Beach, Florida ocean border\"", "docs": [{"k": 0, "title": "Miami Beach, Florida ", "text": " Miami Beach, Florida Miami Beach is a coastal resort city in Miami-Dade County, Florida, United States. It was incorporated on March 26, 1915. The municipality is located on natural and man-made barrier islands between the Atlantic Ocean and Biscayne Bay, the latter of which separates the Beach from Miami. The neighborhood of South Beach, comprising the southernmost of Miami Beach, along with downtown Miami and the Port of Miami, collectively form the commercial center of South Florida. As of the 2010 census, Miami Beach had a total population of 87,779. It has been one of America's pre-eminent beach resorts since"}, {"k": 1, "title": "North Miami Beach, Florida ", "text": " North Miami Beach is located at . According to the United States Census Bureau, the city has a total area of . of it is land and of it (6.43%) is water. Although the North Miami Beach boundaries once stretched to the Atlantic Ocean, this city on the Intracoastal Waterway no longer has any beaches within its city limits, although they are a short distance away across the inlet. As of 2010, there were 16,402 households out of which 12.1% were vacant. As of 2000, 37.6% had children under the age of 18 living with them. 44.3% were married couples"}]}, "What was the occupation of Lovely Rita according to the song by the Beatles": {"answer_gt": "Traffic Warden", "answer_pred": " Meter-maid", "query": "\n\n\"Lovely Rita\" Beatles song occupation", "docs": [{"k": 0, "title": "Lovely Rita ", "text": " Lovely Rita \"Lovely Rita\" is a song by the Beatles performed on the album \"Sgt. Pepper's Lonely Hearts Club Band\", written and sung by Paul McCartney and credited to Lennon–McCartney. It is about a female traffic warden and the narrator's affection for her. The term \"meter-maid\", largely unknown in the UK prior to the song's release, is American slang for a female traffic warden. According to some sources, the song originates from when a female traffic warden named Meta Davies issued a parking ticket to McCartney outside Abbey Road Studios. Instead of becoming angry, he accepted it with good grace"}, {"k": 1, "title": "Lovely Rita ", "text": " Out There! Tour. Lovely Rita \"Lovely Rita\" is a song by the Beatles performed on the album \"Sgt. Pepper's Lonely Hearts Club Band\", written and sung by Paul McCartney and credited to Lennon–McCartney. It is about a female traffic warden and the narrator's affection for her. The term \"meter-maid\", largely unknown in the UK prior to the song's release, is American slang for a female traffic warden. According to some sources, the song originates from when a female traffic warden named Meta Davies issued a parking ticket to McCartney outside Abbey Road Studios. Instead of becoming angry, he accepted it"}]}, "Who was Poopdeck Pappys most famous son?": {"answer_gt": "Popeye", "answer_pred": " 1936", "query": "\n\n\"Poopdeck Pappy\" \"most famous son\"", "docs": [{"k": 0, "title": "Poopdeck Pappy ", "text": " \"squinky\" eye and his pipe, he recognizes his long-lost father—though, as in their meeting on Goon Island, Pappy initially refuses to accept that Popeye is his son. He also appears in Popeye and Son, in \"Poopdeck Pappy and the Family Tree.\" While he comes to help his grandson Junior with his school report, traces of the classic Pappy come shining through when describing their ancestors in greater unsavory detail (much to Junior's initial dismay). Poopdeck Pappy Poopdeck Pappy is a fictional character featured in the \"Popeye\" (\"Thimble Theatre\") comic strip and animated cartoon spinoffs. Created by E. C. Segar in"}, {"k": 1, "title": "Poopdeck Pappy ", "text": " Poopdeck Pappy Poopdeck Pappy is a fictional character featured in the \"Popeye\" (\"Thimble Theatre\") comic strip and animated cartoon spinoffs. Created by E. C. Segar in 1936, the character is Popeye's father, who is between the ages of 85 and 99. Pappy first appeared in \"Thimble Theatre\" not long after Popeye acquired Eugene the Jeep in 1936. Popeye decided to use the creature's supernatural knowledge to find his father. An expedition was set up to go to Poopdeck's home on Barnacle Island, which included Toar the caveman and Olive Oyl. The ungrateful father answered Popeye's greeting with, \"You look like"}]}, "The Nazi regime was Germany's Third Reich; which was the first Reich?": {"answer_gt": "HOLY ROMAN EMPIRE", "answer_pred": " Third Reich", "query": "\n\n\"First Reich Germany\" Nazi regime", "docs": [{"k": 0, "title": "German Reich ", "text": " the German state between 1871 and 1918. The history of the nation-state known as the German \"Reich\" is commonly divided into three periods: The Nazi regime later called itself the \"Third Reich,\" counting the Holy Roman Empire as the first and the 1871 German Empire as the second, and ignoring the Weimar Republic. The name \"Deutsches Reich\" was occasionally applied in contemporary maps to the Holy Roman Empire (911–1806), also called \"Holy Roman Empire of the German Nation\" from the 16th century onwards, though it constituted a supranational entity extending beyond the frontiers of the German language area (\"Sprachraum\"). The"}, {"k": 1, "title": "Nazi Germany ", "text": " Nazi leadership on trial for war crimes at the Nuremberg trials. The official name of the state was \"Deutsches Reich\" from 1933 to 1943 and \"Großdeutsches Reich\" from 1943 to 1945, while common English terms are \"Nazi Germany\" and \"Third Reich\". The latter, adopted by Nazi propaganda as \"Drittes Reich\", was first used in a 1923 book by Arthur Moeller van den Bruck. The book counted the Holy Roman Empire (962–1806) as the first Reich and the German Empire (1871–1918) as the second. Germany was known as the Weimar Republic during the years 1919 to 1933. It was a republic"}]}, "At which English racecourse did two horses collapse and die in the parade ring due to electrocution, in February 2011?": {"answer_gt": "Newbury", "answer_pred": " February 2011", "query": "\n\n\"English racecourse two horses collapse electrocution February 2011\"", "docs": [{"k": 0, "title": "Newbury Racecourse ", "text": " The novice hurdle race went ahead, starting about 20 min late, but the rest of the day's racing was abandoned. On 17 February, the preliminary results of the investigation into the incident were released. Professor Tim Morris, Director of Equine Science and Welfare for the British Horseracing Authority, reported that they had been informed that there had been leakage from an electrical cable running under the parade ring. Both the horses had been examined postmortem and sudden cardiac arrest, consistent with accidental electrocution, had been identified as the cause of death and no other cause of death was further investigated."}, {"k": 1, "title": "Newbury Racecourse ", "text": " supporting their album Where We Are. Each year the racecourse hosts two music nights, with acts in recent years including: Jess Glynne, Olly Murs, Craig David and Rudimental. The racecourse has a dedicated railway station, which sees heavy traffic and additional trains on race days. It also acts as a venue for conferences, meetings, weddings and Hen and Stag parties. On 12 February 2011, two horses, Marching Song and Fenix Two, collapsed and died in the Paddock while parading for the first race of the day. Two others also appeared to have been affected, Kid Cassidy and The Merry Giant."}]}, "Which type of hat takes its name from an 1894 novel by George Du Maurier where the title character has the surname O'Ferrall ?": {"answer_gt": "TRILBY", "answer_pred": " Trilby", "query": "\n\n\"O'Ferrall hat\" 1894 George Du Maurier novel", "docs": [{"k": 0, "title": "George du Maurier ", "text": " a film, and as an opera. His second novel \"Trilby\", was published in 1894. It fitted into the gothic horror genre which was undergoing a revival during the \"fin de siècle\", and the book was hugely popular. The story of the poor artist's model Trilby O'Ferrall, transformed into a diva under the spell of the evil musical genius Svengali, created a sensation. Soap, songs, dances, toothpaste, and even the city of Trilby in Florida, were all named for the heroine, and the variety of soft felt hat with an indented crown that was worn in the London stage dramatization of"}, {"k": 1, "title": "Trilby (novel) ", "text": " Trilby (novel) Trilby is a novel by George du Maurier and one of the most popular novels of its time. Published serially in \"Harper's Monthly\" from January to August 1894, it was published in book form on 8 September 1895 and sold 200,000 copies in the United States alone. \"Trilby\" is set in the 1850s in an idyllic bohemian Paris. Though it features the stories of two English artists and a Scottish artist, one of the most memorable characters is Svengali, a rogue, masterful musician and hypnotist. Trilby O'Ferrall, the novel's heroine, is a half-Irish girl working in Paris as"}]}, "What was the Elephant Man's real name?": {"answer_gt": "Joseph Merrick", "answer_pred": " Oneal Bryan", "query": "\n\n\"Elephant Man\" real name", "docs": [{"k": 0, "title": "Elephant Man (musician) ", "text": " Elephant Man (musician) Oneal Bryan, better known by his stage name Elephant Man, (born September 11, 1975), is a Jamaican dancehall musician and singer. Born in Kingston, Jamaica, he started out his musical career as a member of the Scare Dem Crew, later continuing as a solo artist. He was later characterised for several trademarks, such as his dyed yellow-orange hair, his unique low-key voice, and his stage performance, which included jumping and running, or even climbing on stage props and monitors. His acoustic trademark is a light lisp. Bryan had his first international recognition when he and Puma settled"}, {"k": 1, "title": "Elephant Man (comics) ", "text": " Elephant Man (comics) \"For other uses, see\" Elephant man. Elephant Man is a fictional character, and is a DC Comics supervillain. Debuting in \"Teen Titans\" vol.3, #35 during the One Year Later event, Elephant Man resembles an upright, humanoid elephant. When Brain and Monsieur Mallah gathered together yet another version of the Brotherhood of Evil, they found some able new members. One of these members calls himself Elephant Man. He's a powerful behemoth with a thick hide and rotten attitude. He is recruited at the same time as Goldilocks. When the Brotherhood of Evil fought the Teen Titans, Elephant Man"}]}, "Which number Beethoven symphony is known as ‘The Pastoral’?": {"answer_gt": "SIXTH", "answer_pred": " Op. 68", "query": "\n\n\"Beethoven Symphony 'The Pastoral' Number\"", "docs": [{"k": 0, "title": "Symphony No. 6 (Beethoven) ", "text": " Symphony No. 6 (Beethoven) The Symphony No. 6 in F major, Op. 68, also known as the Pastoral Symphony (German: \"Pastorale\"), is a symphony composed by Ludwig van Beethoven and completed in 1808. One of Beethoven's few works containing explicitly programmatic content, the symphony was first performed in the Theater an der Wien on 22 December 1808 in a four-hour concert. Beethoven was a lover of nature who spent a great deal of his time on walks in the country. He frequently left Vienna to work in rural locations. The composer said that the Sixth Symphony is \"more the expression"}, {"k": 1, "title": "Symphony No. 6 (Beethoven) ", "text": " ending sequence. Symphony No. 6 (Beethoven) The Symphony No. 6 in F major, Op. 68, also known as the Pastoral Symphony (German: \"Pastorale\"), is a symphony composed by Ludwig van Beethoven and completed in 1808. One of Beethoven's few works containing explicitly programmatic content, the symphony was first performed in the Theater an der Wien on 22 December 1808 in a four-hour concert. Beethoven was a lover of nature who spent a great deal of his time on walks in the country. He frequently left Vienna to work in rural locations. The composer said that the Sixth Symphony is \"more"}]}, "Which man won a record 26 Academy Award 'Oscars'?": {"answer_gt": "Walt Disney", "answer_pred": " 6", "query": "\n\n\"man won record 26 Academy Award Oscars\"", "docs": [{"k": 0, "title": "26th Academy Awards ", "text": " base just prior to the Pearl Harbor attack and World War II, illustrating the conflict between an individualistic private (Montgomery Clift) and rigid institutional authority (exemplified by the Army). Its achievement of eight awards matched the then record held by \"Gone with the Wind\" (1939). The record would be tied again the following year by \"On the Waterfront\" (1954). Walt Disney won four awards, which remains the record for the most Oscars won in the same year. William Holden's speech for Best Actor for his role in \"Stalag 17\" was simply \"Thank You\", making it one of the shortest speeches"}, {"k": 1, "title": "John Ford ", "text": " film left on the floor when I'm finished. Ford won a total of six Academy Awards. Four of these were for Best Director for \"The Informer\" (1935), \"The Grapes of Wrath\" (1940), \"How Green Was My Valley\" (1941), and \"The Quiet Man\" (1952)—none of them Westerns (also starring in the last two was Maureen O'Hara, \"his favorite actress\"). He was also nominated as Best Director for \"Stagecoach\" (1939). He won two Oscars for Best Documentary for \"The Battle of Midway\" and \"\". To this day Ford holds the record for winning the most Best Director Oscars, having won the award"}]}, "In golf, a six under par score has never been, and is unlikely to ever be recorded, as it requires a hole in one on a par-seven hole. What is the 'mythical' term for such a hypothetical performance? (hint: think about the names of under par scores)": {"answer_gt": "Phoenix", "answer_pred": " Condor", "query": "\n\n\"Mythical term for six under par score in golf\"", "docs": [{"k": 0, "title": "Par (golf scoring format) ", "text": " reward or punishment due when a bogey 5 is recorded on a par 4. Thus, a 0 (zero) is recorded. A double-bogey 6 (one over what's expected from a player on a 9 handicap, would incur a penalty of a minus '−'. A 4 (a genuine, unadjusted par) is one better than a '9-handicapper' would be expected to score and would earn a plus '+'. However, for this golfer, 6s and above still incur just one minus '−'. Likewise, 4s and below earn just one plus '+'. At the end of the round, plusses and minuses are reconciled (a minus"}, {"k": 1, "title": "Par (score) ", "text": " history and the first to be televised and the first on Augusta's par-five second hole, Rafael Cabrera-Bello at the 2017 Players Championship, and Brooks Koepka at the 2018 Players Championship. Condor is an unofficial name for a score of four under par (−4). This is the lowest individual hole score ever made. A condor would be a hole-in-one on a par-five (typically by cutting over a dogleg corner), a two on a par-six or a three on a par-seven (neither of which has ever been achieved as of December 2016). Par-sixes are exceptionally rare, as are par-sevens. As of October"}]}, "Who taught Eliza Dolittle to be a lady ?": {"answer_gt": "Professor Henry Higgins", "answer_pred": " Professor Henry Higgins", "query": "\n\n\"Eliza Dolittle\" \"teacher\" \"lady\"", "docs": [{"k": 0, "title": "Eliza Doolittle ", "text": " Eliza Doolittle Eliza Doolittle is a fictional character from London who appears in the play \"Pygmalion\" (George Bernard Shaw, 1912) and the musical version of that play, \"My Fair Lady\". Eliza is a Cockney flower girl, who comes to Professor Henry Higgins asking for elocution lessons, after a chance encounter at Covent Garden. Higgins goes along with it for the purposes of a wager: That he can turn her into the toast of elite London society. Her Cockney dialect includes words that are common among working class Londoners, such as ain't; \"I ain't done nothing wrong by speaking to the"}, {"k": 1, "title": "My Fair Lady ", "text": " a hit London production, a popular film version, and many revivals. \"My Fair Lady\" has been called \"the perfect musical\". It is Edwardian London, the Royal Opera House, Covent Garden. The protagonist, Eliza Doolittle, is a Cockney with a thick, unintelligible accent. Professor Henry Higgins invites Colonel Pickering to stay as his houseguest. Soon after, Eliza Doolittle comes to Professor Higgins's house, seeking elocution lessons. Professor Higgins wagers Colonel Pickering, that in six months he will turn Eliza into a lady by teaching her to speak properly. Eliza is indentured into the Higgins household as a resident elocution student. After"}]}, "Which virus spread by fleas was deliberately introduced into Australia to control rabbits in 1951?": {"answer_gt": "Myxomatosis", "answer_pred": " 1950", "query": "\n\n\"Australia 1951 virus fleas rabbits control\"", "docs": [{"k": 0, "title": "Myxomatosis ", "text": " Myxomatosis Myxomatosis is a disease that affects rabbits, caused by the \"myxoma\" virus. It was first observed in Uruguay in laboratory rabbits in the late 19th century. It was introduced into Australia in 1950 in an attempt to control the rabbit population (see Rabbits in Australia). Affected rabbits develop skin tumors, and in some cases blindness, followed by fatigue and fever; they usually die within 14 days of contracting the disease. The disease is spread by direct contact with an affected animal or by being bitten by fleas or mosquitoes that have fed on an infected rabbit. The myxomatosis virus"}, {"k": 1, "title": "The Country Hour ", "text": " \"The Country Hour\". In 1951, the Victorian edition of \"The Country Hour\" broke the news of the decision to introduce the Myxoma virus into Australia in a bid to control the wild rabbit population, after Ian Clunies Ross told rural reporter Graham White about the plan. In 2015, \"The Country Hour\" celebrated its 70th anniversary, prompting tributes from well-known figures and a mention in the Parliament of Australia when Western Australian Senator Dean Smith reflected on the rural issues and events that had been covered by \"The Country Hour\" particularly in Western Australia. A special national edition of \"The Country"}]}, "Name either of the detectives created by Reginald Hill in novels such as 'A Pinch of Snuff' and 'Ruling Passions', who later featured in a popular TV series?": {"answer_gt": "DALZIEL & PASCOE", "answer_pred": " 1994", "query": "\n\n\"Reginald Hill\" \"detectives\" \"A Pinch of Snuff\" \"Ruling Passions\" TV series", "docs": [{"k": 0, "title": "A Pinch of Snuff (TV series) ", "text": " as Insp. Ray Crabtree. The series broadcast over three consecutive Saturday nights, from 9 April 1994. Reginald Hill was said to have been unhappy with the series; and as such prevented ITV from creating any further adaptations for television. \"The Independent\" went on to describe the \"critical contempt heaped on the first television version\" of the legendary characters. It described how \"a complex story of pornography and murder was turned into a vehicle for the dramatic talents of Hale and Pace, by common consent breathtakingly miscast as the chalk-and-cheese Yorkshire coppers. While either of them might conceivably have scraped by"}, {"k": 1, "title": "A Pinch of Snuff (TV series) ", "text": " A Pinch of Snuff (TV series) A Pinch of Snuff is a British television crime drama miniseries, consisting of three fifty-minute episodes, that broadcast on ITV network from 9 to 23 April 1994. The series, adapted from the novel of the same name by author Reginald Hill, was the first \"Dalziel and Pascoe\" adaptation for TV, arriving two years before the more widely-known and acclaimed BBC adaptation that followed in 1996. In this miniseries, the characters of Dalziel and Pascoe were played by comedians Gareth Hale and Norman Pace, with Christopher Fairbank as loyal sidekick Edgar Wield, and Malcolm Storry"}]}, "What is the official march of the Royal Navy?": {"answer_gt": "Heart of Oak", "answer_pred": " \"Heart of Oak\"", "query": "\n\n\"Royal Navy official march\"", "docs": [{"k": 0, "title": "Heart of Oak ", "text": " Heart of Oak \"Heart of Oak\" is the official march of the Royal Navy of the United Kingdom. It is also the official march of several Commonwealth navies including the Royal Canadian Navy and the Royal New Zealand Navy. It was also the official march of the Royal Australian Navy, but has now been replaced by the new march, \"Royal Australian Navy.\" The music of \"Heart of Oak\" was composed by William Boyce, and the words were written by the 18th-century English actor David Garrick. \"Heart of Oak\" was originally written as part of an opera. It was first played"}, {"k": 1, "title": "3DB (Melbourne) ", "text": " the official march of the Royal Navy, the Royal Australian Navy and some other navies. By the 1960s 3DB was using a Columbia recording of the march, played by the Orchestra of the Royal Marines, conducted by Sir Vivian Dunn. The main news bulletins at 7.45am, 12.30pm and 7.00pm used the first 25 seconds of the theme, whilst other bulletins only used a smaller section. In 1930, test cricketer Don Bradman was a household name throughout Australia. There were even people who incorrectly believed that the call-sign 3DB was based on Bradman's initials. Bradman's popularity led to great interest in"}]}, "On which label did Chuck Berry record in the 1950s and 1960s?": {"answer_gt": "Chess", "answer_pred": " Chess Records", "query": "\n\n\"Chuck Berry\" 1950s 1960s label", "docs": [{"k": 0, "title": "Chuck Berry ", "text": " state lines. After his release in 1963, Berry had several more hits, including \"No Particular Place to Go\", \"You Never Can Tell\", and \"Nadine\". But these did not achieve the same success, or lasting impact, of his 1950s songs, and by the 1970s he was more in demand as a nostalgic performer, playing his past hits with local backup bands of variable quality. However, in 1972 he reached a new level of achievement when a rendition of \"My Ding-a-Ling\" became his only record to top the charts. His insistence on being paid in cash led in 1979 to a four-month"}, {"k": 1, "title": "Music history of the United States in the 1950s ", "text": " a specifically rock and roll style of playing of such exponents as Chuck Berry, Link Wray, and Scotty Moore. Chuck Berry, who is considered to be one of the pioneers of Rock and roll music, refined and developed the major elements that made rock and roll distinctive, focusing on teen life and introducing guitar solos and showmanship that would be a major influence on subsequent rock music. Artists such as Chuck Berry, Bo Diddley, Fats Domino, Little Richard, Jerry Lee Lewis, Big Joe Turner, and Gene Vincent released the initial rhythm and blues-influenced early rock and roll hits. Rock and"}]}, "\"Which British king, famous for his string of mistresses,said \"\"I do not believe God would damn a man for a little irregular pleasure\"\" ? He made pleasure-seeking an art form, &was keenly interested in theatre and horse-racing, and was the first monarch to have his own yacht.\"": {"answer_gt": "CHARLES II", "answer_pred": " \"Appetites are free\"", "query": "\n\n\"British king pleasure-seeking mistresses theatre horse-racing yacht quote 'I do not believe God would damn a man for a little irregular pleasure'\"", "docs": [{"k": 0, "title": "Gilbert Burnet ", "text": " young the \"baseness of human nature\". Like many other observers he noted Charles's remarkable self-control: \"he has a strange command of himself: he can pass from business to pleasure, and from pleasure to business, in so easy a manner that all things seem alike to him.\" He also recorded some of the King's most memorable sayings, such as \"Appetites are free, and Almighty God will never damn a man for allowing himself a little pleasure\". During the Popish Plot, when Queen Catherine was accused of treason, (it was alleged that she had conspired to murder her husband), the King confided"}, {"k": 1, "title": "Sir Gawain and the Carle of Carlisle ", "text": " to seek the Green Chapel through the mud and ice of a northern English winter, when most would rather have sought to avoid it. It is courtesy that impels him to comply with the terms of Sir Bertilak's Christmas game, to give a pretence of enjoying himself when his death seems imminent, and to politely and honourably rebuff the sexual advances of his host's wife when it might be his last opportunity for pleasure. And when he has offered to marry a hideous hag in \"The Wedding of Sir Gawain and Dame Ragnelle\", in order to save King Arthur's life,"}]}, "Who wrote The Railway Children?": {"answer_gt": "Edith Nesbit", "answer_pred": " Edith Nesbit", "query": "\n\n\"author of The Railway Children\"", "docs": [{"k": 0, "title": "The Railway Children ", "text": " The Railway Children The Railway Children is a children's book by Edith Nesbit, originally serialised in \"The London Magazine\" during 1905 and first published in book form in 1906. It has been adapted for the screen several times, of which the 1970 film version is the best known. The \"Oxford Dictionary of National Biography\" credits Oswald Barron, who had a deep affection for Nesbit, with having provided the plot. The setting is thought to be inspired by Edith's walks to Chelsfield railway station close to where she lived, and her observing the construction of the railway cutting and tunnel between"}, {"k": 1, "title": "The Railway Children ", "text": " being a criminal. The Railway Children The Railway Children is a children's book by Edith Nesbit, originally serialised in \"The London Magazine\" during 1905 and first published in book form in 1906. It has been adapted for the screen several times, of which the 1970 film version is the best known. The \"Oxford Dictionary of National Biography\" credits Oswald Barron, who had a deep affection for Nesbit, with having provided the plot. The setting is thought to be inspired by Edith's walks to Chelsfield railway station close to where she lived, and her observing the construction of the railway cutting"}]}, "Technically a shoal of fish becomes a school of fish when it is?": {"answer_gt": "Swimming in the same direction", "answer_pred": " Shoal to school when synchronized.", "query": "\n\n\"When does a shoal of fish become a school of fish\"", "docs": [{"k": 0, "title": "Shoaling and schooling ", "text": " from the group. Facultative shoalers, such as Atlantic cod, saiths and some carangids, shoal only some of the time, perhaps for reproductive purposes. Shoaling fish can shift into a disciplined and coordinated school, then shift back to an amorphous shoal within seconds. Such shifts are triggered by changes of activity from feeding, resting, travelling or avoiding predators. When schooling fish stop to feed, they break ranks and become shoals. Shoals are more vulnerable to predator attack. The shape a shoal or school takes depends on the type of fish and what the fish are doing. Schools that are travelling can"}, {"k": 1, "title": "Fish ", "text": " localised resource such as food or nesting sites is known simply as an \"aggregation\". When fish come together in an interactive, social grouping, then they may be forming either a \"shoal\" or a \"school\" depending on the degree of organisation. A \"shoal\" is a loosely organised group where each fish swims and forages independently but is attracted to other members of the group and adjusts its behaviour, such as swimming speed, so that it remains close to the other members of the group. \"Schools\" of fish are much more tightly organised, synchronising their swimming so that all fish move at"}]}, "Who plays the role of Bubble in Absolutely Fabulous?": {"answer_gt": "Jane Horrocks", "answer_pred": " Golden Globe", "query": "\n\n\"Bubble Absolutely Fabulous actor\"", "docs": [{"k": 0, "title": "Jane Horrocks ", "text": " became a name with the role of Bubble in \"Absolutely Fabulous\" (1992–2016). While working on \"Road\", a play directed by Jim Cartwright, Horrocks warmed up by doing singing impressions of Judy Garland, Shirley Bassey and Ethel Merman. Cartwright was so impressed with her mimicry he wrote \"The Rise and Fall of Little Voice\" for her. She was nominated for the Laurence Olivier Award for Best Actress for her performance in the 1992 West End production, directed by her boyfriend Sam Mendes. She reprised her role in the 1998 screen adaptation, \"Little Voice\", which earned nominations for the Golden Globe Award"}, {"k": 1, "title": "Jane Horrocks ", "text": " Jane Horrocks Barbara Jane Horrocks (born 18 January 1964) is an English actress, voice artist, musician and singer, who played the roles of Bubble and Katy Grin in the BBC sitcom \"Absolutely Fabulous\" (1992–2012). She was nominated for the 1993 Olivier Award for Best Actress for the title role in \"The Rise and Fall of Little Voice\", and received Golden Globe and BAFTA Award nominations when she reprised the role in the 1998 film \"Little Voice\". Her other film roles include \"The Witches\" (1990), \"Life Is Sweet\" (1990), \"Chicken Run\" (2000), \"Corpse Bride\" (2005) and \"Sunshine on Leith\" (2013). Horrocks,"}]}, "On which island was the famous photograph taken showing US Marines raising the US flag over Mt Suribachi in February 1945?": {"answer_gt": "Iwo Jima", "answer_pred": " 1945", "query": "\n\n\"US Marines raising US flag over Mt Suribachi February 1945 island\"", "docs": [{"k": 0, "title": "Raising the Flag on Iwo Jima ", "text": " February 23, four days after the battle began. Despite capturing Suribachi, the battle continued to rage for many days, and the island would not be declared \"secure\" until 31 days later, on March 26. There were two American flags raised on top of Mount Suribachi, on February 23, 1945. The photograph Rosenthal took was actually of the second flag-raising in which a larger replacement flag was raised by Marines who did not raise the first flag. A U.S. flag was first raised atop Mount Suribachi soon after the mountaintop was captured at around 10:20 on February 23, 1945. Lieutenant Colonel"}, {"k": 1, "title": "Raising the Flag on Iwo Jima ", "text": " Raising the Flag on Iwo Jima Raising the Flag on Iwo Jima is an iconic photograph taken by Joe Rosenthal on February 23, 1945, which depicts six United States Marines raising a U.S. flag atop Mount Suribachi, during the Battle of Iwo Jima, in World War II. The photograph was first published in Sunday newspapers on February 25, 1945. It was extremely popular and was reprinted in thousands of publications. Later, it became the only photograph to win the Pulitzer Prize for Photography in the same year as its publication, and came to be regarded in the United States as"}]}, "A mill in Woodbridge, Suffolk, England, built in the 12th century, reconstructed in 1792, further restored in 2010 and currently in full working order is a early English example of a mill powered by what?": {"answer_gt": "Tide", "answer_pred": " Tricker's Mill", "query": "\n\n\"12th century mill Woodbridge Suffolk England 1792 reconstruction 2010 restoration currently working powered by\"", "docs": [{"k": 0, "title": "Tide mill ", "text": " Dover harbour. By the 18th century, there were about 76 tide mills in London, including two on London Bridge. Woodbridge Tide Mill, an excellent example, survives at Woodbridge, Suffolk, England. This mill, dating from 1170 and reconstructed in 1792, has been preserved and is open to the public. It was further restored in 2010 and re-opened in 2011 in full working order. It is the second working tide mill in the United Kingdom that is regularly producing flour. Carew Castle in Wales also has an intact tide mill, but it is not operating. The first tide mill to be restored"}, {"k": 1, "title": "Tricker's Mill, Woodbridge ", "text": " housing scheme for the elderly. In 2011 Flagship Housing who run the sheltered housing decide to sell the Mill. W & T Catchpole, having bought the Mill, commission architect Tim Buxbaum and J P Chick & Sons Structural Engineers to liaise with Mark Barnard from Suffolk Coastal on emergency restoration work. Paul Rust commences work to repair and stabilise the mill in January 2012. By March 2016 the work has been completed and the mill is available to rent as holiday accommodation. \"Tricker's Mill\" is a five storey tower mill which formerly had a boat shaped cap with a gallery"}]}, "Moon River is an Oscar winning song from which movie?": {"answer_gt": "Breakfast At Tiffany's", "answer_pred": " Breakfast at Tiffany's", "query": "\n\n\"Moon River\" Oscar winning song movie", "docs": [{"k": 0, "title": "Moon River ", "text": " Moon River \"Moon River\" is a song composed by Henry Mancini with lyrics by Johnny Mercer. It was originally performed by Audrey Hepburn in the 1961 movie \"Breakfast at Tiffany's\", winning an Academy Award for Best Original Song. The song also won the 1962 Grammy Awards for Record of the Year and Song of the Year. The song has been covered by many other artists. It became the theme song for Andy Williams, who first recorded it in 1962 (and performed it at the Academy Awards ceremony that year). He sang the first eight bars of the song at the"}, {"k": 1, "title": "Moon River and Other Great Movie Themes ", "text": " of an entire album of songs from movies, and he wound up recording the rejected song on January 4, 1962. A few months later he was again offered the chance to sing \"Moon River\", this time at the Academy Awards on April 9 because of its nomination for Best Original Song. The April 28 issue of \"Billboard\" magazine reported that the album had \"racked up orders, according to Columbia Records, of close to 40,000 within two weeks' release. Platter was rushed out by the label to coincide with Williams' performance of the Mancini tune on the Academy Awards Show a"}]}, "In the TV sit-com 'Red Dwarf', what was the name of the ship's sentient computer?": {"answer_gt": "'HOLLY'", "answer_pred": " Holly", "query": "\n\n\"Red Dwarf\" TV sit-com ship sentient computer name", "docs": [{"k": 0, "title": "Kryten (Red Dwarf) ", "text": " Kryten (Red Dwarf) \"Kryten\" is the seventh episode from science fiction sit-com \"Red Dwarf\", the first from series two, and was first broadcast on BBC2 on 6 September 1988. Written by Rob Grant and Doug Naylor, and directed by Ed Bye, this episode introduced the mechanoid character Kryten. The episode was re-mastered, along with the rest of the first three series, in 1998. \"Red Dwarf\" receives a distress call from a crashed spaceship, the \"Nova 5\". As usual, Rimmer (Chris Barrie) claims this to be aliens. But according to the on-board service mechanoid that sent the distress call, Kryten (David"}, {"k": 1, "title": "Spacecraft in Red Dwarf ", "text": " (Search for Intelligent Universe station) was a research facility appearing in the episode \"Krysis\" (2016). Located in the depths of deep space, the S.I.U. station intended to prove the theory that the Universe was a sentient entity and to establish contact with it. The Oregon is mentioned by Captain Hollister in \"The End\" (1988), citing example of a ship that had experienced an animal quarantine related incident, apparently involving rabbits. The SS \"Scott Fitzgerald\" is mentioned in the episode \"Better Than Life\" (1988). It is the ship to which the 11th generation AI computer Gordon resides. The SS \"Augustus\" is"}]}, "Which film starring Steve McQueen featured a car chase through the streets of San Francisco?": {"answer_gt": "Bullitt", "answer_pred": " Bullitt", "query": "\n\n\"Steve McQueen\" car chase \"San Francisco\" movie", "docs": [{"k": 0, "title": "Steve McQueen ", "text": " which he stars opposite Candice Bergen and Richard Attenborough (with whom he had previously worked in \"The Great Escape\"). He followed his Oscar nomination with 1968's \"Bullitt\", one of his best-known films, which co-starred Jacqueline Bisset, Robert Vaughn, and Don Gordon. It featured an unprecedented (and endlessly imitated) auto chase through San Francisco. Although McQueen did do the driving that appeared in closeup, this was about 10% of what is seen in the film's car chase. The rest of the driving by McQueen's character was done by stunt drivers Bud Ekins and Loren Janes. The antagonist's black was driven by"}, {"k": 1, "title": "Dodge Charger (B-body) ", "text": " framing two thick ones). The stripes were standard on the R/Ts and came in red, white, or black, but could be deleted at no extra cost. The 1968 film Bullitt helped popularize the Charger R/T for its notable car chase sequence alongside the titular character's 1968 Ford Mustang GT through the streets of San Francisco, which has been regarded as one of the most influential car chase scenes in movie history. In the film, a black Dodge Charger R/T 440 is chased by Steve McQueen's Ford Mustang GT, jumping on the San Francisco slopes. The 1968 model year Charger sales"}]}, "What was the first name of the character played by John Travolta in Saturday Night Fever.": {"answer_gt": "Tony (Manero).", "answer_pred": " Tony", "query": "\n\n\"John Travolta Saturday Night Fever character first name\"", "docs": [{"k": 0, "title": "John Travolta ", "text": " John Travolta John Joseph Travolta (born February 18, 1954) is an American actor, film producer, dancer, and singer. Travolta first became known in the 1970s, after appearing on the television series \"Welcome Back, Kotter\" (1975–1979) and starring in the box office successes \"Saturday Night Fever\" (1977) and \"Grease\" (1978). His acting career declined through the 1980s, but enjoyed a resurgence in the 1990s with his role in \"Pulp Fiction\" (1994), and he has since starred in films such as \"Get Shorty\", \"Broken Arrow\", \"Face/Off\", \"Swordfish\", \"Be Cool\", \"Wild Hogs\", \"Hairspray\", and \"The Taking of Pelham 123\". Travolta was nominated for"}, {"k": 1, "title": "Neri Parenti ", "text": " insolito destino (John Travolto [overwhelmed] ... by an unusual destiny)\", an ironic and comical imitation of \"Saturday Night Fever\" with John Travolta, which had been a hit two years earlier. A year later he met the film actor and director Paolo Villaggio, who was then filming \"Fantozzi contro tutti (Fantozzi against all)\". Villaggio developed an esteem for Parenti and decided to leave the director’s chair to join forces with him. The result was very positive and the pair made another six films with the Fantozzi character, from \"Fantozzi subisce ancora (Fantozzi still suffers)\" (1983) to \"Fantozzi - Il ritorno (Fantozzi"}]}, "Maria Dickin was the founder of which British animal charity in 1917?": {"answer_gt": "Peoples Dispensary for Sick Animals", "answer_pred": " 1917", "query": "\n\n\"Maria Dickin\" \"British animal charity\" \"1917\" founder", "docs": [{"k": 0, "title": "Maria Dickin ", "text": " Maria Dickin Maria Elisabeth Dickin CBE (nickname, Mia; 22 September 1870 – 1 March 1951) was a social reformer and an animal welfare pioneer who founded the People's Dispensary for Sick Animals (PDSA) in 1917. Born in 1870 in London, she was the oldest of eight children; her parents were William George Dickin, a Wesleyan minister, and Ellen Maria (née Exell). She married her first cousin, Arnold Francis Dickin, an accountant, in 1899; they had no children. She enjoyed music, literary work and philanthropy. Dickin died in London in 1951 of influenzal broncho-pneumonia. The Dickin Medal is named after her."}, {"k": 1, "title": "Maria Dickin ", "text": " A commemorative blue plaque was erected by English Heritage at Dickin's birthplace, 41 Cassland Road (formerly 1 Farringdon Terrace) in Hackney in October 2015. Maria Dickin Maria Elisabeth Dickin CBE (nickname, Mia; 22 September 1870 – 1 March 1951) was a social reformer and an animal welfare pioneer who founded the People's Dispensary for Sick Animals (PDSA) in 1917. Born in 1870 in London, she was the oldest of eight children; her parents were William George Dickin, a Wesleyan minister, and Ellen Maria (née Exell). She married her first cousin, Arnold Francis Dickin, an accountant, in 1899; they had no"}]}, "Which river flows from northern Moscow to the Caspian Sea?": {"answer_gt": "Volga", "answer_pred": " Volga", "query": "\n\n\"river flows from northern Moscow to Caspian Sea\"", "docs": [{"k": 0, "title": "Moskva River ", "text": " Moskva River The Moskva River (, \"Moskva-reka\") is a river of western Russia. It rises about west of Moscow, and flows roughly east through the Smolensk and Moscow Oblasts, passing through central Moscow. About south east of Moscow, at the city of Kolomna, it flows into the Oka River, itself a tributary of the Volga, which ultimately flows into the Caspian Sea. \"Moskva\" and \"Moscow\" are two different renderings of the same Russian word \"Москва\". The city is named after the river. Finno-Ugric Merya and Muroma people, who originally inhabited the area, called the river \"Mustajoki\". It has been suggested"}, {"k": 1, "title": "Moskva River ", "text": " Moskva River The Moskva River (, \"Moskva-reka\") is a river of western Russia. It rises about west of Moscow, and flows roughly east through the Smolensk and Moscow Oblasts, passing through central Moscow. About south east of Moscow, at the city of Kolomna, it flows into the Oka River, itself a tributary of the Volga, which ultimately flows into the Caspian Sea. \"Moskva\" and \"Moscow\" are two different renderings of the same Russian word \"Москва\". The city is named after the river. Finno-Ugric Merya and Muroma people, who originally inhabited the area, called the river \"Mustajoki\". It has been suggested"}]}, "What hero from Greek mythology was killed by a discus thrown by Apollo, who then named a flower after him, made from his spilled blood?": {"answer_gt": "Hyacinth", "answer_pred": " Apollo", "query": "\n\n\"Greek mythology hero killed by Apollo discus flower\"", "docs": [{"k": 0, "title": "The Death of Hyacinthos ", "text": " the plaster model by Callamard) represents the death of Hyacinthos, Apollo’s favorite, while playing discus with the god. The young man is struck with a fatal blow; he is dying in Apollo’s arms, who changes him into the flower that bears his name (see previously referenced page). Egyptian mythology, on which the Greeks probably founded their entire religious system, tells us that Apollo, son of Zeus, was gifted with extraordinary beauty, such that the sun was named after him. This prince, who was equally commendable for his spiritual qualities as for his external beauty, was the first to teach science"}, {"k": 1, "title": "Hyacinth House ", "text": " of the term Hyacinth is thought to be Morrison's way of expressing his unhappiness. Further, Hyacinthus was a beautiful youth and lover of the Greek god Apollo. According to the myth, Apollo accidentally killed Hyacinthus in a discus throwing contest when the latter ran to catch Apollo's discus in an effort to impress the god. After the unfortunate death, Apollo refused to let Hades claim the youth. Rather, from Hyacinthus' blood, Apollo created the hyacinth, a plant with a fragrant cluster of flowers. This interpretation of \"Hyacinth House\" is furthermore based on the song's lyrical reference to another Doors' song,"}]}, "What is the historical subject matter of Arthur Miller’s 1953 play The Crucible?": {"answer_gt": "Salem Witch Trials", "answer_pred": " 1996", "query": "\n\n\"Arthur Miller\" \"The Crucible\" 1953 \"historical subject matter\"", "docs": [{"k": 0, "title": "The Crucible ", "text": " The Crucible The Crucible is a 1953 play by American playwright Arthur Miller. It is a dramatized and partially fictionalized story of the Salem witch trials that took place in the Massachusetts Bay Colony during 1692/93. Miller wrote the play as an allegory for McCarthyism, when the United States government persecuted people accused of being communists. Miller himself was questioned by the House of Representatives' Committee on Un-American Activities in 1956 and convicted of contempt of Congress for refusing to identify others present at meetings he had attended. The play was first performed at the Martin Beck Theatre on Broadway"}, {"k": 1, "title": "The Crucible (1996 film) ", "text": " The Crucible (1996 film) The Crucible is a 1996 American historical drama film written by Arthur Miller adapting his play of the same title, inspired by the Salem witchcraft trials. It was directed by Nicholas Hytner and stars Daniel Day-Lewis as John Proctor, Winona Ryder as Abigail Williams, Paul Scofield as Judge Thomas Danforth, Bruce Davison as Reverend Parris, and Joan Allen as Elizabeth Proctor. Much of the filming took place on Hog Island in Ipswich, Massachusetts. Despite the film's lacklustre box office performance, Arthur Miller was nominated for the Academy Award for Best Adapted Screenplay and Joan Allen received"}]}, "What is the surname of the TV sibling characters Chris, Meg and Stewie (and pet Brian)?": {"answer_gt": "GRIFFIN", "answer_pred": " Griffin", "query": "\n\n\"Chris Meg Stewie Brian TV Sibling Surname\"", "docs": [{"k": 0, "title": "Chris Griffin ", "text": " Chris Griffin Christopher Cross \"Chris\" Griffin is a fictional character from the animated television series \"Family Guy\". He is the middle child of Peter and Lois Griffin and brother of Stewie and Meg Griffin. He is voiced by Seth Green and first appeared on television, along with the rest of the Griffin family, in a 15-minute short on December 20, 1998. Chris was created and designed by MacFarlane himself, who was asked to pitch a pilot to the Fox Broadcasting Company, based on \"The Life of Larry\" and \"Larry & Steve\", two shorts made by MacFarlane featuring a middle-aged man"}, {"k": 1, "title": "North by North Quahog ", "text": " a second honeymoon to enliven their marriage, and leave their anthropomorphic dog Brian to take care of their children Stewie, Chris, and Meg. Brian is unable to control the children, but Stewie offers to help (in exchange for Brian changing his diaper) and together they manage the home. The pair chaperone a dance at Chris's school, during which the school principal catches Chris in the boys' restroom with vodka that belongs to his classmate Jake Tucker. Although Brian and Stewie punish Chris by grounding him, they try to clear his name. Jake's father Tom refuses to believe Brian and Stewie,"}]}, "Caroline of Brunswick was the queen consort of which British King?": {"answer_gt": "GEORGE IV", "answer_pred": " Caroline of Brunswick", "query": "\n\n\"Caroline of Brunswick queen consort British King\"", "docs": [{"k": 0, "title": "Caroline of Brunswick ", "text": " Caroline of Brunswick Caroline of Brunswick (Caroline Amelia Elizabeth; 17 May 1768 – 7 August 1821) was Queen consort of the United Kingdom as the wife of King George IV from 29 January 1820 until her death in 1821. She was the Princess of Wales from 1795 to 1820. Her father, Charles William Ferdinand, was the ruler of Brunswick-Wolfenbüttel in Germany, and her mother, Augusta, was the sister of the British king George III. In 1794, she was engaged to her first cousin and George III's eldest son, George, despite the two of them never having met and George already"}, {"k": 1, "title": "Lady of the Bedchamber ", "text": " British Royal Household. Anne of Denmark was Queen Consort to James I of England. Henrietta Maria was Queen Consort to Charles I of England. Catherine of Braganza was Queen Consort to Charles II of England Mary of Modena was Queen Consort to James II of England Caroline of Ansbach was Queen Consort to George II of Great Britain Princess Augusta was the wife of Frederick, Prince of Wales Charlotte of Mecklenberg-Strelitz was Queen Consort to King George III of Great Britain Caroline of Brunswick was the wife of George, Prince of Wales, Prince Regent and from 1820 Queen Consort to"}]}, "Which football league championship side plays home games at Keepmoat Stadium?": {"answer_gt": "DONCASTER ROVERS", "answer_pred": " Doncaster", "query": "\n\n\"Football League Championship side Keepmoat Stadium home games\"", "docs": [{"k": 0, "title": "2007 BAFL season ", "text": " 2007 BAFL season The 2007 BAFL Season is the British American Football League. BritBowl XXI, the league's championship game, was scheduled to be played at Keepmoat Stadium in Doncaster on September 23, 2007. Based on the British American Football League, setup for the 2007 season there will be a 3 tier structure consisting of: \"W = Wins, L = Losses, T = Ties, PCT = Winning Percentage, PF= Points For, PA = Points Against\" \"Clinched playoff seeds are marked in parentheses and shaded in green, for BAFL 2 divisions the colours have been changed to indicate Northern and Southern sides"}, {"k": 1, "title": "Wrigley Field ", "text": " for the goal posts. Five NFL championship games were played at Wrigley Field; 1933, 1937, 1941, 1943 and 1963. Coupled with the Chicago Bears, the Chicago Cardinals of the National Football League called Wrigley Field home from 1931-1938. Born on the South Side of Chicago, the Cardinals also played their home games at Normal Park, Comiskey Park, and Soldier Field. The Northwestern Wildcats and the Illinois Fighting Illini played a college football game at Wrigley Field on November 20, 2010. It was the first football game at Wrigley Field since 1970 and the first collegiate football game at Wrigley Field"}]}, "In which US state is Green Bay?": {"answer_gt": "Wisconsin", "answer_pred": " Wisconsin", "query": "\n\n\"Green Bay\" US state", "docs": [{"k": 0, "title": "Green Bay, Wisconsin ", "text": " Green Bay, Wisconsin Green Bay is a city in and the county seat of Brown County in the U.S. state of Wisconsin, at the head of Green Bay, a sub-basin of Lake Michigan, at the mouth of the Fox River. It is above sea level and north of Milwaukee. The population was 104,057 at the 2010 census. Green Bay is the third-largest city in the state of Wisconsin, after Milwaukee and Madison, and the third-largest city on Lake Michigan's west shore, after Chicago and Milwaukee. Green Bay is home to the National Football League's Green Bay Packers. Green Bay is"}, {"k": 1, "title": "Green Bay, Wisconsin ", "text": " side. It is anchored by Ross Dress for Less, Party City, T.J. Maxx, HomeGoods, Big Lots, and Office Depot. It contains specialty shops and restaurants. Green Bay, Wisconsin Green Bay is a city in and the county seat of Brown County in the U.S. state of Wisconsin, at the head of Green Bay, a sub-basin of Lake Michigan, at the mouth of the Fox River. It is above sea level and north of Milwaukee. The population was 104,057 at the 2010 census. Green Bay is the third-largest city in the state of Wisconsin, after Milwaukee and Madison, and the third-largest"}]}, "What is the name of the perfume launched by British boyband JLS in January 2013?": {"answer_gt": "Love", "answer_pred": " January 2013", "query": "\n\n\"JLS perfume launched January 2013\"", "docs": [{"k": 0, "title": "JLS ", "text": " together to create brand new fashion line, \"2KX\". Burke and JLS stated, \"We are eagerly waiting for the first stocks of the ultra-hyped menswear and womenswear range, due very soon.\" To coincide with the launch of their third album \"Jukebox\", they will feature in their very own edition of 'TheirMag', a newly formed sister publication to Rio Ferdinand's \"#5\" magazine. In March 2012, they launched their first fragrance, \"Kiss\", which sold 100,000 bottles on the first day. All four of the band members worked with perfume designer Azzi Glasser to form the scent. In February 2013, they launched their second"}, {"k": 1, "title": "JLS ", "text": " called \"Billion Lights\", which was released on 17 November 2013 and charted at number 19 on the UK Singles Chart. JLS officially split up following the final gig of their Goodbye Tour at The O2 Arena in London on 22 December 2013. As well as appearing on numerous TV programmes for promotion of their albums/singles, JLS have had two special TV shows of their own broadcast. The first was an hour-long documentary for ITV2, titled \"JLS Revealed\", which first aired on 7 November 2009. The documentary followed them in the year after they had finished second in \"The X Factor\","}]}, "Who said sex is a bad thing it rumples the clothes?": {"answer_gt": "Jacqueline Kennedy Onassis", "answer_pred": " Janet Jackson", "query": "\n\n\"Who said sex is a bad thing it rumples the clothes\"", "docs": [{"k": 0, "title": "Simon Lokodo ", "text": " at women. Clothes that are considered revealing or sexually provocative were to be outlawed; \"If you dress in such a way that you irritate the mind and excite the people then you are badly dressed; if you draw the attention of the other person outside there with a malicious purpose of exciting and stimulating him or her into sex,\" Lokodo stated. He is reported to speak and write fluent English, Italian, French, German, and Spanish. Simon Lokodo Simon Lokodo is a Ugandan politician who has served as Minister of State for Ethics & Integrity in the Office of the President"}, {"k": 1, "title": "Sex Is Not the Enemy ", "text": " Justin Timberlake in what was referred to as a \"wardrobe malfunction\". Manson noticed that the incident was featured on the \"USA Today\" cover for three days in a row with no mention of the Iraq War. Manson felt the media \"was only focusing on Janet's beautiful tit, which I thought was bizarre\". The singer declared that there are \"a lot worse things to have your children see on TV that parents are happily plopping their kids down in front of\", and thus she wrote a song \"sort of dealing with that and dealing with the idea that this administration is"}]}, "Jonas Salk developed a vaccine against what?": {"answer_gt": "Polio", "answer_pred": " 1955", "query": "\n\n\"Jonas Salk vaccine\"", "docs": [{"k": 0, "title": "Jonas Salk ", "text": " Jonas Salk Jonas Edward Salk (; October 28, 1914June 23, 1995) was an American medical researcher and virologist. He discovered and developed one of the first successful polio vaccines. Born in New York City, he attended New York University School of Medicine, later choosing to do medical research instead of becoming a practicing physician. In 1939, after earning his medical degree, Salk began an internship as a physician scientist at Mount Sinai Hospital. Two years later he was granted a fellowship at the University of Michigan, where he would study flu viruses with his mentor Thomas Francis, Jr. Until 1955,"}, {"k": 1, "title": "Jonas Salk ", "text": " vaccine. A few weeks later, Salk injected children at the Polk State School for the retarded and feeble-minded. In 1954 he tested the vaccine on about one million children, known as the polio pioneers. The vaccine was announced as safe on April 12, 1955. The project became large, involving 100 million contributors to the March of Dimes, and 7 million volunteers. The foundation allowed itself to go into debt to finance the final research required to develop the Salk vaccine. Salk worked incessantly for two and a half years. Salk's inactivated polio vaccine was the first vaccine for the disease;"}]}, "The site of Carthage is now in a suburb of which modem capital city?": {"answer_gt": "Tunis", "answer_pred": " Tunis", "query": "\n\n\"Carthage site modern capital city\"", "docs": [{"k": 0, "title": "History of Carthage ", "text": " is a tourist attraction. The Carthage Palace (the Tunisian presidential palace), is located in the city. The modern Carthage, beyond its residential vocation, seems to be invested with an affirmed political role. The geographical configuration of Carthage, as an old peninsula, save Carthage, of Tunis' inconveniences and embarrassments and increase its attractiveness as a residency place toward the elites. If Carthage is not the capital, it tends to be the political pole, a \" place of emblematic power \" according to Sophie Bessis, leaving to Tunis the economic and administrative roles. Some ancient translations of Punic texts into Greek and"}, {"k": 1, "title": "History of Carthage ", "text": " more protracted campaign lasted from 670 to 683. In 698, the Exarchate of Africa was finally overrun by Hassan Ibn al Numan and a force of 40,000 men. The population was displaced to the neighbouring town of Tunis which in turn vastly eclipsed Carthage as the major regional centre. Carthage's materials were used to supply the expansion of Tunis. The destruction of the Exarchate of Africa marked a permanent end to the Byzantine Empire's influence in the region. The modern Carthage is a suburb of Tunis, the capital city of Tunisia, situated at the site of the ancient capital of"}]}, "Which is the largest island in Canada?": {"answer_gt": "Baffin Island", "answer_pred": " Baffin Island", "query": "\n\n\"Largest island in Canada\"", "docs": [{"k": 0, "title": "Baffin Island ", "text": " Baffin Island Baffin Island ( , ), in the Canadian territory of Nunavut, is the largest island in Canada and the fifth-largest island in the world. Its area is and its population is about 11,000 (2007 estimate). It is located 65.4215 N and 70.9654 W. Named after English explorer William Baffin, it is likely that the island was known to Pre-Columbian Norse explorers from Greenland and Iceland and that it was the location of \"Helluland\", spoken of in the Icelandic sagas (the Grœnlendinga saga and the Saga of Erik the Red, Eiríks saga rauða). Iqaluit, the capital of Nunavut, is"}, {"k": 1, "title": "Queen Elizabeth Islands ", "text": " of the Canadian Arctic Archipelago. Many of the islands are among the largest in the world, the largest being Ellesmere Island. Other major islands include Amund Ringnes Island, Axel Heiberg Island, Bathurst Island, Borden Island, Cornwall Island, Cornwallis Island, Devon Island, Eglinton Island, Ellef Ringnes Island, Mackenzie King Island, Melville Island, and Prince Patrick Island. Other smaller but notable islands include; Beechey Island (), which held the graves of Petty Officer John Torrington, Royal Marine Private William Braine, and Able Seaman John Hartnell, three members of Sir John Franklin's crew, Hans Island (), a small, uninhabited barren knoll measuring whose"}]}, "Which organization of the Catholic church whose name is Latin for 'Work of God' received world attention with the publication of The Da Vinci Code in which it is portrayed as participating in a sinister international conspiracy?": {"answer_gt": "Opus Dei", "answer_pred": " Opus Dei", "query": "\n\n\"Catholic Church organization Latin name 'Work of God' Da Vinci Code conspiracy\"", "docs": [{"k": 0, "title": "Conspiracy fiction ", "text": " under Westminster Abbey. Their attempt to expose the feminine aspect of Christianity's origins results in fierce Church opposition and, eventually, an international manhunt. Umberto Eco's \"Foucault's Pendulum\" (1988) features a story in which the staff of a publishing firm, intending to create a series of popular occult books, invent their own occult conspiracy, over which they lose control as it begins to supplant the truth. The popular 2003 novel \"The Da Vinci Code\" by Dan Brown draws on conspiracy theories involving the Roman Catholic Church, Opus Dei and the Priory of Sion. Other contemporary authors who have used elements of"}, {"k": 1, "title": "The Da Vinci Hoax ", "text": " the Roman Catholic Church throughout the centuries. The authors state that the theories, while presented as great revelations of hidden knowledge, are actually based on elements of gnostic and feminist ideas. They contend that the theories transparently contradict serious scholarship, and present detailed arguments and expositions against them. The Da Vinci Hoax The Da Vinci Hoax is a non-fiction book written by Carl E. Olsen and Sandra Miesel for the express purpose of critiquing Dan Brown's novel \"The Da Vinci Code.\" The book was first published in 2004 by Ignatius Press. According to Olson and Miesel, they wrote it out"}]}, "Who is said to have cut the Gordian Knot?": {"answer_gt": "Alexander the Great", "answer_pred": " Alexander the Great", "query": "\n\n\"Who cut Gordian Knot\"", "docs": [{"k": 0, "title": "Gordian Knot ", "text": " Gordian Knot The Gordian Knot is a legend of Phrygian Gordium associated with Alexander the Great. It is often used as a metaphor for an intractable problem (disentangling an \"impossible\" knot) solved easily by finding a loophole or thinking creatively (\"cutting the Gordian knot\"): The Phrygians were without a king, but an oracle at Telmissus (the ancient capital of Lycia) decreed that the next man to enter the city driving an ox-cart should become their king. A peasant farmer named Gordias drove into town on an ox-cart and was immediately declared king. Out of gratitude, his son Midas dedicated the"}, {"k": 1, "title": "Gordium ", "text": " range wide enough to accommodate both proposed archaeological dates. Although the date of the destruction continues to be debated, a date of c. 800 BCE is now most-commonly accepted. According to ancient tradition, in 333 BCE Alexander the Great cut (or otherwise unfastened) the Gordian Knot: this intricate knot joined the yoke to the pole of a Phrygian wagon that stood on the acropolis of the city. The wagon was associated with Midas or Gordias (or both), and was connected with the dynasty's rise to power. A local prophecy had decreed that whoever could loosen the knot was destined to"}]}, "Who in verse sailed to the land where the bong tree grows": {"answer_gt": "The owl and the pussycat", "answer_pred": " French", "query": "\n\n\"Sailors to land of bong tree\"", "docs": [{"k": 0, "title": "James Ramsey Ullman ", "text": " the Bong Tree Grows,\" an account of a year he spent travelling through some of the most remote islands of the South Pacific. Ullman also wrote a novel about the poet Arthur Rimbaud, \"The Day on Fire\" (1958). He joined the American Mount Everest Expedition 1963 as an official historian. Because of health problems he had to stay in Kathmandu. His book \"Americans on Everest: The Official Account of the Ascent\" was published in 1964. The authour, James Ramsey Ullman, died in Boston from cancer on July 5, 1971. His papers, which include an archive regarding Temple Fielding, are at"}, {"k": 1, "title": "Myōkoku-ji ", "text": " hall on the location. On December 13, 1923 the tree became a national natural monument. On February 15, Keiō 4, (March 8, 1868) almost 100 sailors from a French warship offshore boarded boats and landed at Sakai Port. They came into Sakai for sightseeing and loitered inside temples and shrines and scared women and children who were astonished by the foreigners. The guardians of Myōkoku temple from the Tosa clan sought out the French sailors, but were unable to resolve the problem because of mass confusion and the inability to understand each other's language. When the French sailors took a"}]}, "On which river is Kings Lynn": {"answer_gt": "The Great Ouse", "answer_pred": " Virginia Beach", "query": " located\n\n\"Kings Lynn\" river", "docs": [{"k": 0, "title": "King's Lynn Docks ", "text": " King's Lynn Docks King's Lynn Docks are located to the north of the town of King's Lynn in the English county of Norfolk. They are on the River Great Ouse which provides access to the North Sea via the Lynn Channel and The Wash. They are located north of Cambridge, west of Norwich and north of London on the A1078 Edward Benefer Way. The docks are operated as the Port of King's Lynn by Associated British Ports. It handles around 750,000 tonnes of cargo a year, including agricultural and forest products, chemicals, steel and other metals. Three docks, including the"}, {"k": 1, "title": "Lynnhaven River ", "text": " the Lynnhaven River Basin is currently under consideration by Congress. Notable historic residences near the entrance include the Adam Keeling House, Adam Thoroughgood House, and Ferry Plantation House and the area was the site of the early colonial settlement of Henry Town. Adam Thoroughgood was from King's Lynn in Norfolk, England. Many locations in Virginia Beach, including the Lynnhaven River, Lynn Shores, Thalia Lynn, Lynnhaven Road (parkway, drive, etc.) are named Lynn after King's Lynn. Lynnhaven River The Lynnhaven River is a tidal estuary located in the independent city of Virginia Beach, Virginia, in the United States, and flows into"}]}, "Which 1969 film, based on a stage musical, marked the directorial debut of Richard Attenborough?": {"answer_gt": "OH! WHAT A LOVELY WAR", "answer_pred": " 1969", "query": "\n\n\"Richard Attenborough\" 1969 \"film\" \"stage musical\" directorial debut", "docs": [{"k": 0, "title": "Oh! What a Lovely War ", "text": " Oh! What a Lovely War Oh! What a Lovely War is a 1969 British comedy musical film directed by Richard Attenborough (in his directorial debut), with an ensemble cast including Maggie Smith, Dirk Bogarde, John Gielgud, John Mills, Kenneth More, Laurence Olivier, Jack Hawkins, Corin Redgrave, Michael Redgrave, Vanessa Redgrave, Ralph Richardson, Ian Holm, Paul Shelley, Malcolm McFee, Jean-Pierre Cassel, Nanette Newman, Edward Fox, Susannah York, John Clements, Phyllis Calvert and Maurice Roëves. The film is based on the stage musical \"Oh, What a Lovely War!\", originated by Charles Chilton as a radio play, \"The Long Long Trail\" in December"}, {"k": 1, "title": "Oh, What a Lovely War! ", "text": " the CD41 album series \"Oh! It's A Lovely War\" (four volumes). Richard Attenborough's sweeping and elaborate film adaptation was released in 1969, also as a musical, and garnered numerous awards. It was Attenborough's debut as a director, and one of Maggie Smith's earliest film appearances. Several Australian World War I movies and miniseries (e.g. \"The Lighthorsemen\" and \"Gallipoli\") have used these songs to give a stronger sense of period to them. The 1985 series \"Anzacs\" used \"Oh, it's a lovely war\" as one of the numbers while the credits rolled, had \"I wore a tunic\" performed as part of an"}]}, "Stylised as a lower case x, the album ‘Multiply’, which topped the UK charts for 8 weeks in 2014, is by which Brit award-winning singer-songwriter?": {"answer_gt": "Ed Sheeran", "answer_pred": " BRIT Award", "query": "\n\n\"brit award-winning singer-songwriter multiply album x uk charts 2014\"", "docs": [{"k": 0, "title": "X (Ed Sheeran album) ", "text": " X (Ed Sheeran album) x (pronounced \"multiply\") is the second studio album by English singer-songwriter, Ed Sheeran. It was released on 20 June 2014 in Australia and New Zealand, and worldwide on 23 June through Asylum Records and Atlantic Records. The album received positive reviews from music critics. It was an international commercial success, peaking at No. 1 in fifteen countries, while topping both the UK Albums Chart and the US \"Billboard\" 200. \"x\" also reached the top 5 in seven other countries and was the best selling album of 2014 in Australia, New Zealand, Ireland, and the United Kingdom."}, {"k": 1, "title": "X (Ed Sheeran album) ", "text": " taken from album liner notes. Main personnel Additional personnel X (Ed Sheeran album) x (pronounced \"multiply\") is the second studio album by English singer-songwriter, Ed Sheeran. It was released on 20 June 2014 in Australia and New Zealand, and worldwide on 23 June through Asylum Records and Atlantic Records. The album received positive reviews from music critics. It was an international commercial success, peaking at No. 1 in fifteen countries, while topping both the UK Albums Chart and the US \"Billboard\" 200. \"x\" also reached the top 5 in seven other countries and was the best selling album of 2014"}]}, "\"What beer is advertised by \"\"The World's Most Interesting Man\"\"?\"": {"answer_gt": "Dos Equis", "answer_pred": " 2006", "query": "\n\n\"The World's Most Interesting Man\" beer advertisement", "docs": [{"k": 0, "title": "The Most Interesting Man in the World ", "text": " The Most Interesting Man in the World The Most Interesting Man in the World was an advertising campaign for Dos Equis beer. The ads featured a bearded, debonair gentleman with voiceovers that were both humorous and outrageous and the slogan \"Stay Thirsty My Friends\". The advertisements first began appearing in the United States in 2006 and became a popular Internet meme. The campaign was ended in 2018. The advertisements first began appearing in the United States in 2006, with The Most Interesting Man in the World portrayed by American actor Jonathan Goldsmith, and \"Frontline\" narrator Will Lyman providing voiceovers. They"}, {"k": 1, "title": "The Most Interesting Man in the World ", "text": " host Joseph Gordon-Levitt played the unimpressive son of The Most Interesting Man in the World in a pair of sketches, with Jason Sudeikis appearing as his father in the second. The Most Interesting Man in the World The Most Interesting Man in the World was an advertising campaign for Dos Equis beer. The ads featured a bearded, debonair gentleman with voiceovers that were both humorous and outrageous and the slogan \"Stay Thirsty My Friends\". The advertisements first began appearing in the United States in 2006 and became a popular Internet meme. The campaign was ended in 2018. The advertisements first"}]}, "Which tennis player, born in 1946, was nicknamed ‘Nasty’?": {"answer_gt": "Ilie Nastase", "answer_pred": " 1946", "query": "\n\n\"Tennis player born 1946 nicknamed 'Nasty'\"", "docs": [{"k": 0, "title": "Ilie Năstase ", "text": " Ilie Năstase Ilie \"Nasty\" Năstase (, born 19 July 1946) is a Romanian former world No. 1 professional tennis player, and one of the world's top players of the 1970s. He was ranked world No. 1 from 23 August 1973 to 2 June 1974. Năstase is one of the ten players in history who have won more than 100 ATP professional titles (58 singles and 45 in doubles). He was inducted into the International Tennis Hall of Fame in 1991. Năstase won seven Grand Slam titles: two in singles, three in men's doubles and two in mixed doubles. He also"}, {"k": 1, "title": "Ilie Năstase ", "text": " in February 2010, after six years of marriage. As he played for the Army's sports club Steaua, he was an employee of the Ministry of Defence.. He was granted the rank of retired Major General. On 25 May 2018, Năstase was arrested twice within a six-hour span in one day for drunk driving and riding a scooter through a red light. \"Qualifying matches and Walkovers are neither official match wins nor losses.\" Ilie Năstase Ilie \"Nasty\" Năstase (, born 19 July 1946) is a Romanian former world No. 1 professional tennis player, and one of the world's top players of"}]}, "What commonly used English Latin expression means literally 'so' or 'thus' or 'in this manner', and generally refers to a quoted error?": {"answer_gt": "Sic", "answer_pred": " intentionally", "query": "\n\n\"commonly used English Latin expression 'sic' meaning\"", "docs": [{"k": 0, "title": "Sic ", "text": " intentionally reproduced, exactly as they appear in the source text. It is generally placed inside square brackets to indicate that it is not part of the quoted matter. \"Sic\" may also be used derisively by the proofreader, to call attention to the original writer's spelling mistakes or erroneous logic, or to show general disapproval or dislike of the material. Though occasionally misidentified as an abbreviated word, \"sic\" is a Latin adverb used in English as an adverb, and, derivatively, as a noun and a verb. The adverb \"sic\", meaning \"intentionally so written\", first appeared in English circa 1856. It is"}, {"k": 1, "title": "Sic ", "text": " derived from the Latin adverb \"sīc\", which means \"so, thus, in this manner\". According to the \"Oxford English Dictionary\", the verbal form of \"sic\", meaning \"to mark with a \"sic\"\", emerged in 1889, E. Belfort Bax work in \"The Ethics of Socialism\" being an early example. On occasion, \"sic\" has been misidentified as an acronym (and therefore sometimes misspelled with full stops/periods): \"s.i.c.\" is said to stand for \"spelled in context\", \"said in copy\", \"spelling is correct\", \"spelled incorrectly\", and other such folk etymology phrases. These are all incorrect and are simply backronyms from \"sic\". Use of \"sic\" greatly increased"}]}, "What is the name for a person who tried to turn base metals into gold?": {"answer_gt": "Alchemist", "answer_pred": " chrysopoeia", "query": "\n\n\"alchemist\" OR \"alchemy\" OR \"transmutation of metals\" OR \"transmutation of base metals into gold\"", "docs": [{"k": 0, "title": "Alchemy ", "text": " Alchemy Alchemy (from Arabic: \"al-kīmiyā\") was an ancient branch of natural philosophy, a philosophical and protoscientific tradition practiced throughout Europe, Africa, and Asia, originating in Hellenistic Egypt (primarily Alexandria) between the 4th and 3rd centuries BCE. It aims to purify, mature, and perfect certain objects. Common aims were chrysopoeia, the transmutation of \"base metals\" (e.g., lead) into \"noble metals\" (particularly gold); the creation of an elixir of immortality; the creation of panaceas able to cure any disease; and the development of an alkahest, a universal solvent. The perfection of the human body and soul was thought to permit or result"}, {"k": 1, "title": "Pseudo-Geber ", "text": " most widely read alchemy books in western Europe in the late medieval period. Its author assumed that all metals are composed of unified sulfur and mercury corpuscles and gave detailed descriptions of metallic properties in those terms. The use of an elixir for transmuting base metals into gold is explained (see philosopher's stone) and a lengthy defense is given defending alchemy against the charge that transmutation of metals was impossible. The practical directions for laboratory procedures were so clear that it is obvious the author was familiar with many chemical operations. It contains early recipes for producing mineral acids, much"}]}, "Which US State ended prohibition in November 1948, a law that had been in place there for 68 years?": {"answer_gt": "Kansas", "answer_pred": " 1933", "query": "\n\n\"US State ended prohibition November 1948 68 years\"", "docs": [{"k": 0, "title": "Repeal of Prohibition in the United States ", "text": " Repeal of Prohibition in the United States The repeal of Prohibition in the United States was accomplished with the passage of the Twenty-first Amendment to the United States Constitution on December 5, 1933. In 1919, the requisite number of state legislatures ratified the Eighteenth Amendment to the United States Constitution, enabling national prohibition one year later. Many women, notably members of the Woman’s Christian Temperance Union, were pivotal in bringing about national Prohibition in the United States, believing it would protect families, women, and children from the effects of alcohol abuse. Around 1820, \"the typical adult white American male consumed"}, {"k": 1, "title": "Prohibition in the United States ", "text": " crime, lowering local revenues, and imposing \"rural\" Protestant religious values on \"urban\" United States. Prohibition ended with the ratification of the Twenty-first Amendment, which repealed the Eighteenth Amendment on December 5, 1933. Some states continued statewide prohibition, marking one of the last stages of the Progressive Era. Research shows that prohibition reduced overall alcohol consumption by half during the 1920s, and consumption remained below pre-Prohibition levels until the 1940s, suggesting that Prohibition did socialize a significant proportion of the population in temperate habits, at least temporarily. Rates of liver cirrhosis \"fell by 50% early in Prohibition and recovered promptly after"}]}, "In humans, microcephaly is having an abnormally small what?": {"answer_gt": "Head", "answer_pred": " Cytomegalovirus", "query": "\n\n\"microcephaly humans abnormally small\"", "docs": [{"k": 0, "title": "Microcephaly ", "text": " Microcephaly Microcephaly is a medical condition in which the brain does not develop properly resulting in a smaller than normal head. Microcephaly may be present at birth or it may develop in the first few years of life. Often people with the disorder have an intellectual disability, poor motor function, poor speech, abnormal facial features, seizures, and dwarfism. The disorder may stem from a wide variety of conditions that cause abnormal growth of the brain, or from syndromes associated with chromosomal abnormalities. A homozygous mutation in one of the \"microcephalin\" genes causes primary microcephaly. It serves as an important neurological"}, {"k": 1, "title": "Birth defect ", "text": " in fetuses. Microcephaly is a disorder in which the fetus has an atypically small head, cerebral calcifications means certain areas of the brain have atypical calcium deposits, and meningoencephalitis is the enlargement of the brain. All three disorders cause abnormal brain function or mental retardation. Hepatosplenomegaly is the enlargement of the liver and spleen which causes digestive problems. It can also cause some kernicterus and petechiae. Kernicterus causes yellow pigmentation of the skin, brain damage, and deafness. Petechaie is when the capillaries bleed resulting in red/purple spots on the skin. However, cytomegalovirus is often fatal in the embryo. The herpes"}]}}, "model_q_mode": "rewrite", "model_a_mode": "answer", "model_r_mode": "RM", "wiki_only": "False", "entire_doc": "False", "k": 2}